raphui/rnk/include/platform/stm32f746.h
typedef struct
{
	unsigned int      RESERVED0[2];  /*!< Reserved, 0x00-0x04 */
	unsigned int SSCR;          /*!< LTDC Synchronization Size Configuration Register,    Address offset: 0x08 */
	unsigned int BPCR;          /*!< LTDC Back Porch Configuration Register,              Address offset: 0x0C */
	unsigned int AWCR;          /*!< LTDC Active Width Configuration Register,            Address offset: 0x10 */
	unsigned int TWCR;          /*!< LTDC Total Width Configuration Register,             Address offset: 0x14 */
	unsigned int GCR;           /*!< LTDC Global Control Register,                        Address offset: 0x18 */
	unsigned int      RESERVED1[2];  /*!< Reserved, 0x1C-0x20 */
	unsigned int SRCR;          /*!< LTDC Shadow Reload Configuration Register,           Address offset: 0x24 */
	unsigned int      RESERVED2[1];  /*!< Reserved, 0x28 */
	unsigned int BCCR;          /*!< LTDC Background Color Configuration Register,        Address offset: 0x2C */
	unsigned int      RESERVED3[1];  /*!< Reserved, 0x30 */
	unsigned int IER;           /*!< LTDC Interrupt Enable Register,                      Address offset: 0x34 */
	unsigned int ISR;           /*!< LTDC Interrupt Status Register,                      Address offset: 0x38 */
	unsigned int ICR;           /*!< LTDC Interrupt Clear Register,                       Address offset: 0x3C */
	unsigned int LIPCR;         /*!< LTDC Line Interrupt Position Configuration Register, Address offset: 0x40 */
	unsigned int CPSR;          /*!< LTDC Current Position Status Register,               Address offset: 0x44 */
	unsigned int CDSR;         /*!< LTDC Current Display Status Register,                       Address offset: 0x48 */
} LTDC_TypeDef;  

/** 
 * @brief LCD-TFT Display layer x Controller
 */

typedef struct
{  
	unsigned int CR;            /*!< LTDC Layerx Control Register                                  Address offset: 0x84 */
	unsigned int WHPCR;         /*!< LTDC Layerx Window Horizontal Position Configuration Register Address offset: 0x88 */
	unsigned int WVPCR;         /*!< LTDC Layerx Window Vertical Position Configuration Register   Address offset: 0x8C */
	unsigned int CKCR;          /*!< LTDC Layerx Color Keying Configuration Register               Address offset: 0x90 */
	unsigned int PFCR;          /*!< LTDC Layerx Pixel Format Configuration Register               Address offset: 0x94 */
	unsigned int CACR;          /*!< LTDC Layerx Constant Alpha Configuration Register             Address offset: 0x98 */
	unsigned int DCCR;          /*!< LTDC Layerx Default Color Configuration Register              Address offset: 0x9C */
	unsigned int BFCR;          /*!< LTDC Layerx Blending Factors Configuration Register           Address offset: 0xA0 */
	unsigned int      RESERVED0[2];  /*!< Reserved */
	unsigned int CFBAR;         /*!< LTDC Layerx Color Frame Buffer Address Register               Address offset: 0xAC */
	unsigned int CFBLR;         /*!< LTDC Layerx Color Frame Buffer Length Register                Address offset: 0xB0 */
	unsigned int CFBLNR;        /*!< LTDC Layerx ColorFrame Buffer Line Number Register            Address offset: 0xB4 */
	unsigned int      RESERVED1[3];  /*!< Reserved */
	unsigned int CLUTWR;         /*!< LTDC Layerx CLUT Write Register                               Address offset: 0x144 */

} LTDC_Layer_TypeDef;

/** 
 * @brief Power Control
 */

typedef struct
{
	unsigned int CR;   /*!< PWR power control register,        Address offset: 0x00 */
	unsigned int CSR;  /*!< PWR power control/status register, Address offset: 0x04 */
} PWR_TypeDef;

/** 
 * @brief Reset and Clock Control
 */

typedef struct
{
	unsigned int CR;            /*!< RCC clock control register,                                  Address offset: 0x00 */
	unsigned int PLLCFGR;       /*!< RCC PLL configuration register,                              Address offset: 0x04 */
	unsigned int CFGR;          /*!< RCC clock configuration register,                            Address offset: 0x08 */
	unsigned int CIR;           /*!< RCC clock interrupt register,                                Address offset: 0x0C */
	unsigned int AHB1RSTR;      /*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
	unsigned int AHB2RSTR;      /*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
	unsigned int AHB3RSTR;      /*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
	unsigned int      RESERVED0;     /*!< Reserved, 0x1C                                                                    */
	unsigned int APB1RSTR;      /*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
	unsigned int APB2RSTR;      /*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
	unsigned int      RESERVED1[2];  /*!< Reserved, 0x28-0x2C                                                               */
	unsigned int AHB1ENR;       /*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
	unsigned int AHB2ENR;       /*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
	unsigned int AHB3ENR;       /*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
	unsigned int      RESERVED2;     /*!< Reserved, 0x3C                                                                    */
	unsigned int APB1ENR;       /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
	unsigned int APB2ENR;       /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
	unsigned int      RESERVED3[2];  /*!< Reserved, 0x48-0x4C                                                               */
	unsigned int AHB1LPENR;     /*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
	unsigned int AHB2LPENR;     /*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
	unsigned int AHB3LPENR;     /*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
	unsigned int      RESERVED4;     /*!< Reserved, 0x5C                                                                    */
	unsigned int APB1LPENR;     /*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
	unsigned int APB2LPENR;     /*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
	unsigned int      RESERVED5[2];  /*!< Reserved, 0x68-0x6C                                                               */
	unsigned int BDCR;          /*!< RCC Backup domain control register,                          Address offset: 0x70 */
	unsigned int CSR;           /*!< RCC clock control & status register,                         Address offset: 0x74 */
	unsigned int      RESERVED6[2];  /*!< Reserved, 0x78-0x7C                                                               */
	unsigned int SSCGR;         /*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
	unsigned int PLLI2SCFGR;    /*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */
	unsigned int PLLSAICFGR;    /*!< RCC PLLSAI configuration register,                           Address offset: 0x88 */
	unsigned int DCKCFGR;       /*!< RCC Dedicated Clocks configuration register,                 Address offset: 0x8C */
	unsigned int CKGATENR;      /*!< RCC Clocks Gated Enable Register,                            Address offset: 0x90 */ /* Only for STM32F446xx devices */
	unsigned int DCKCFGR2;      /*!< RCC Dedicated Clocks configuration register 2,               Address offset: 0x94 */ /* Only for STM32F446xx devices */

} RCC_TypeDef;

/** 
 * @brief Real-Time Clock
 */

typedef struct
{
	unsigned int TR;      /*!< RTC time register,                                        Address offset: 0x00 */
	unsigned int DR;      /*!< RTC date register,                                        Address offset: 0x04 */
	unsigned int CR;      /*!< RTC control register,                                     Address offset: 0x08 */
	unsigned int ISR;     /*!< RTC initialization and status register,                   Address offset: 0x0C */
	unsigned int PRER;    /*!< RTC prescaler register,                                   Address offset: 0x10 */
	unsigned int WUTR;    /*!< RTC wakeup timer register,                                Address offset: 0x14 */
	unsigned int CALIBR;  /*!< RTC calibration register,                                 Address offset: 0x18 */
	unsigned int ALRMAR;  /*!< RTC alarm A register,                                     Address offset: 0x1C */
	unsigned int ALRMBR;  /*!< RTC alarm B register,                                     Address offset: 0x20 */
	unsigned int WPR;     /*!< RTC write protection register,                            Address offset: 0x24 */
	unsigned int SSR;     /*!< RTC sub second register,                                  Address offset: 0x28 */
	unsigned int SHIFTR;  /*!< RTC shift control register,                               Address offset: 0x2C */
	unsigned int TSTR;    /*!< RTC time stamp time register,                             Address offset: 0x30 */
	unsigned int TSDR;    /*!< RTC time stamp date register,                             Address offset: 0x34 */
	unsigned int TSSSR;   /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
	unsigned int CALR;    /*!< RTC calibration register,                                 Address offset: 0x3C */
	unsigned int TAFCR;   /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
	unsigned int ALRMASSR;/*!< RTC alarm A sub second register,                          Address offset: 0x44 */
	unsigned int ALRMBSSR;/*!< RTC alarm B sub second register,                          Address offset: 0x48 */
	unsigned int RESERVED7;    /*!< Reserved, 0x4C                                                                 */
	unsigned int BKP0R;   /*!< RTC backup register 1,                                    Address offset: 0x50 */
	unsigned int BKP1R;   /*!< RTC backup register 1,                                    Address offset: 0x54 */
	unsigned int BKP2R;   /*!< RTC backup register 2,                                    Address offset: 0x58 */
	unsigned int BKP3R;   /*!< RTC backup register 3,                                    Address offset: 0x5C */
	unsigned int BKP4R;   /*!< RTC backup register 4,                                    Address offset: 0x60 */
	unsigned int BKP5R;   /*!< RTC backup register 5,                                    Address offset: 0x64 */
	unsigned int BKP6R;   /*!< RTC backup register 6,                                    Address offset: 0x68 */
	unsigned int BKP7R;   /*!< RTC backup register 7,                                    Address offset: 0x6C */
	unsigned int BKP8R;   /*!< RTC backup register 8,                                    Address offset: 0x70 */
	unsigned int BKP9R;   /*!< RTC backup register 9,                                    Address offset: 0x74 */
	unsigned int BKP10R;  /*!< RTC backup register 10,                                   Address offset: 0x78 */
	unsigned int BKP11R;  /*!< RTC backup register 11,                                   Address offset: 0x7C */
	unsigned int BKP12R;  /*!< RTC backup register 12,                                   Address offset: 0x80 */
	unsigned int BKP13R;  /*!< RTC backup register 13,                                   Address offset: 0x84 */
	unsigned int BKP14R;  /*!< RTC backup register 14,                                   Address offset: 0x88 */
	unsigned int BKP15R;  /*!< RTC backup register 15,                                   Address offset: 0x8C */
	unsigned int BKP16R;  /*!< RTC backup register 16,                                   Address offset: 0x90 */
	unsigned int BKP17R;  /*!< RTC backup register 17,                                   Address offset: 0x94 */
	unsigned int BKP18R;  /*!< RTC backup register 18,                                   Address offset: 0x98 */
	unsigned int BKP19R;  /*!< RTC backup register 19,                                   Address offset: 0x9C */
} RTC_TypeDef;


/** 
 * @brief Serial Audio Interface
 */

typedef struct
{
	unsigned int GCR;      /*!< SAI global configuration register,        Address offset: 0x00 */
} SAI_TypeDef;

typedef struct
{
	unsigned int CR1;      /*!< SAI block x configuration register 1,     Address offset: 0x04 */
	unsigned int CR2;      /*!< SAI block x configuration register 2,     Address offset: 0x08 */
	unsigned int FRCR;     /*!< SAI block x frame configuration register, Address offset: 0x0C */
	unsigned int SLOTR;    /*!< SAI block x slot register,                Address offset: 0x10 */
	unsigned int IMR;      /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
	unsigned int SR;       /*!< SAI block x status register,              Address offset: 0x18 */
	unsigned int CLRFR;    /*!< SAI block x clear flag register,          Address offset: 0x1C */
	unsigned int DR;       /*!< SAI block x data register,                Address offset: 0x20 */
} SAI_Block_TypeDef;

/** 
 * @brief SD host Interface
 */

typedef struct
{
	unsigned int POWER;          /*!< SDIO power control register,    Address offset: 0x00 */
	unsigned int CLKCR;          /*!< SDI clock control register,     Address offset: 0x04 */
	unsigned int ARG;            /*!< SDIO argument register,         Address offset: 0x08 */
	unsigned int CMD;            /*!< SDIO command register,          Address offset: 0x0C */
	unsigned int  RESPCMD;        /*!< SDIO command response register, Address offset: 0x10 */
	unsigned int  RESP1;          /*!< SDIO response 1 register,       Address offset: 0x14 */
	unsigned int  RESP2;          /*!< SDIO response 2 register,       Address offset: 0x18 */
	unsigned int  RESP3;          /*!< SDIO response 3 register,       Address offset: 0x1C */
	unsigned int  RESP4;          /*!< SDIO response 4 register,       Address offset: 0x20 */
	unsigned int DTIMER;         /*!< SDIO data timer register,       Address offset: 0x24 */
	unsigned int DLEN;           /*!< SDIO data length register,      Address offset: 0x28 */
	unsigned int DCTRL;          /*!< SDIO data control register,     Address offset: 0x2C */
	unsigned int  DCOUNT;         /*!< SDIO data counter register,     Address offset: 0x30 */
	unsigned int  STA;            /*!< SDIO status register,           Address offset: 0x34 */
	unsigned int ICR;            /*!< SDIO interrupt clear register,  Address offset: 0x38 */
	unsigned int MASK;           /*!< SDIO mask register,             Address offset: 0x3C */
	unsigned int      RESERVED0[2];   /*!< Reserved, 0x40-0x44                                  */
	unsigned int  FIFOCNT;        /*!< SDIO FIFO counter register,     Address offset: 0x48 */
	unsigned int      RESERVED1[13];  /*!< Reserved, 0x4C-0x7C                                  */
	unsigned int FIFO;           /*!< SDIO data FIFO register,        Address offset: 0x80 */
} SDIO_TypeDef;

/** 
 * @brief Serial Peripheral Interface
 */

typedef struct
{
	unsigned short CR1;        /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
	unsigned short      RESERVED0;  /*!< Reserved, 0x02                                                           */
	unsigned short CR2;        /*!< SPI control register 2,                             Address offset: 0x04 */
	unsigned short      RESERVED1;  /*!< Reserved, 0x06                                                           */
	unsigned short SR;         /*!< SPI status register,                                Address offset: 0x08 */
	unsigned short      RESERVED2;  /*!< Reserved, 0x0A                                                           */
	unsigned short DR;         /*!< SPI data register,                                  Address offset: 0x0C */
	unsigned short      RESERVED3;  /*!< Reserved, 0x0E                                                           */
	unsigned short CRCPR;      /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
	unsigned short      RESERVED4;  /*!< Reserved, 0x12                                                           */
	unsigned short RXCRCR;     /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
	unsigned short      RESERVED5;  /*!< Reserved, 0x16                                                           */
	unsigned short TXCRCR;     /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
	unsigned short      RESERVED6;  /*!< Reserved, 0x1A                                                           */
	unsigned short I2SCFGR;    /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
	unsigned short      RESERVED7;  /*!< Reserved, 0x1E                                                           */
	unsigned short I2SPR;      /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
	unsigned short      RESERVED8;  /*!< Reserved, 0x22                                                           */
} SPI_TypeDef;

/** 
 * @brief TIM
 */

typedef struct
{
	unsigned short CR1;         /*!< TIM control register 1,              Address offset: 0x00 */
	unsigned short      RESERVED0;   /*!< Reserved, 0x02                                            */
	unsigned short CR2;         /*!< TIM control register 2,              Address offset: 0x04 */
	unsigned short      RESERVED1;   /*!< Reserved, 0x06                                            */
	unsigned short SMCR;        /*!< TIM slave mode control register,     Address offset: 0x08 */
	unsigned short      RESERVED2;   /*!< Reserved, 0x0A                                            */
	unsigned short DIER;        /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
	unsigned short      RESERVED3;   /*!< Reserved, 0x0E                                            */
	unsigned short SR;          /*!< TIM status register,                 Address offset: 0x10 */
	unsigned short      RESERVED4;   /*!< Reserved, 0x12                                            */
	unsigned short EGR;         /*!< TIM event generation register,       Address offset: 0x14 */
	unsigned short      RESERVED5;   /*!< Reserved, 0x16                                            */
	unsigned short CCMR1;       /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
	unsigned short      RESERVED6;   /*!< Reserved, 0x1A                                            */
	unsigned short CCMR2;       /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
	unsigned short      RESERVED7;   /*!< Reserved, 0x1E                                            */
	unsigned short CCER;        /*!< TIM capture/compare enable register, Address offset: 0x20 */
	unsigned short      RESERVED8;   /*!< Reserved, 0x22                                            */
	unsigned int CNT;         /*!< TIM counter register,                Address offset: 0x24 */
	unsigned short PSC;         /*!< TIM prescaler,                       Address offset: 0x28 */
	unsigned short      RESERVED9;   /*!< Reserved, 0x2A                                            */
	unsigned int ARR;         /*!< TIM auto-reload register,            Address offset: 0x2C */
	unsigned short RCR;         /*!< TIM repetition counter register,     Address offset: 0x30 */
	unsigned short      RESERVED10;  /*!< Reserved, 0x32                                            */
	unsigned int CCR1;        /*!< TIM capture/compare register 1,      Address offset: 0x34 */
	unsigned int CCR2;        /*!< TIM capture/compare register 2,      Address offset: 0x38 */
	unsigned int CCR3;        /*!< TIM capture/compare register 3,      Address offset: 0x3C */
	unsigned int CCR4;        /*!< TIM capture/compare register 4,      Address offset: 0x40 */
	unsigned short BDTR;        /*!< TIM break and dead-time register,    Address offset: 0x44 */
	unsigned short      RESERVED11;  /*!< Reserved, 0x46                                            */
	unsigned short DCR;         /*!< TIM DMA control register,            Address offset: 0x48 */
	unsigned short      RESERVED12;  /*!< Reserved, 0x4A                                            */
	unsigned short DMAR;        /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
	unsigned short      RESERVED13;  /*!< Reserved, 0x4E                                            */
	unsigned short OR;          /*!< TIM option register,                 Address offset: 0x50 */
	unsigned short      RESERVED14;  /*!< Reserved, 0x52                                            */
} TIM_TypeDef;

/** 
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

typedef struct
{
	unsigned short SR;         /*!< USART Status register,                   Address offset: 0x00 */
	unsigned short      RESERVED0;  /*!< Reserved, 0x02                                                */
	unsigned short DR;         /*!< USART Data register,                     Address offset: 0x04 */
	unsigned short      RESERVED1;  /*!< Reserved, 0x06                                                */
	unsigned short BRR;        /*!< USART Baud rate register,                Address offset: 0x08 */
	unsigned short      RESERVED2;  /*!< Reserved, 0x0A                                                */
	unsigned short CR1;        /*!< USART Control register 1,                Address offset: 0x0C */
	unsigned short      RESERVED3;  /*!< Reserved, 0x0E                                                */
	unsigned short CR2;        /*!< USART Control register 2,                Address offset: 0x10 */
	unsigned short      RESERVED4;  /*!< Reserved, 0x12                                                */
	unsigned short CR3;        /*!< USART Control register 3,                Address offset: 0x14 */
	unsigned short      RESERVED5;  /*!< Reserved, 0x16                                                */
	unsigned short GTPR;       /*!< USART Guard time and prescaler register, Address offset: 0x18 */
	unsigned short      RESERVED6;  /*!< Reserved, 0x1A                                                */
} USART_TypeDef;

/** 
 * @brief Window WATCHDOG
 */

typedef struct
{
	unsigned int CR;   /*!< WWDG Control register,       Address offset: 0x00 */
	unsigned int CFR;  /*!< WWDG Configuration register, Address offset: 0x04 */
	unsigned int SR;   /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/** 
 * @brief Crypto Processor
 */

