raphui/rnk/include/platform/stm32f746.h
/*******************  Bit definition for CAN_F12R2 register  ******************/
#define  CAN_F12R2_FB0                       ((unsigned int)0x00000001)        /*!<Filter bit 0 */
#define  CAN_F12R2_FB1                       ((unsigned int)0x00000002)        /*!<Filter bit 1 */
#define  CAN_F12R2_FB2                       ((unsigned int)0x00000004)        /*!<Filter bit 2 */
#define  CAN_F12R2_FB3                       ((unsigned int)0x00000008)        /*!<Filter bit 3 */
#define  CAN_F12R2_FB4                       ((unsigned int)0x00000010)        /*!<Filter bit 4 */
#define  CAN_F12R2_FB5                       ((unsigned int)0x00000020)        /*!<Filter bit 5 */
#define  CAN_F12R2_FB6                       ((unsigned int)0x00000040)        /*!<Filter bit 6 */
#define  CAN_F12R2_FB7                       ((unsigned int)0x00000080)        /*!<Filter bit 7 */
#define  CAN_F12R2_FB8                       ((unsigned int)0x00000100)        /*!<Filter bit 8 */
#define  CAN_F12R2_FB9                       ((unsigned int)0x00000200)        /*!<Filter bit 9 */
#define  CAN_F12R2_FB10                      ((unsigned int)0x00000400)        /*!<Filter bit 10 */
#define  CAN_F12R2_FB11                      ((unsigned int)0x00000800)        /*!<Filter bit 11 */
#define  CAN_F12R2_FB12                      ((unsigned int)0x00001000)        /*!<Filter bit 12 */
#define  CAN_F12R2_FB13                      ((unsigned int)0x00002000)        /*!<Filter bit 13 */
#define  CAN_F12R2_FB14                      ((unsigned int)0x00004000)        /*!<Filter bit 14 */
#define  CAN_F12R2_FB15                      ((unsigned int)0x00008000)        /*!<Filter bit 15 */
#define  CAN_F12R2_FB16                      ((unsigned int)0x00010000)        /*!<Filter bit 16 */
#define  CAN_F12R2_FB17                      ((unsigned int)0x00020000)        /*!<Filter bit 17 */
#define  CAN_F12R2_FB18                      ((unsigned int)0x00040000)        /*!<Filter bit 18 */
#define  CAN_F12R2_FB19                      ((unsigned int)0x00080000)        /*!<Filter bit 19 */
#define  CAN_F12R2_FB20                      ((unsigned int)0x00100000)        /*!<Filter bit 20 */
#define  CAN_F12R2_FB21                      ((unsigned int)0x00200000)        /*!<Filter bit 21 */
#define  CAN_F12R2_FB22                      ((unsigned int)0x00400000)        /*!<Filter bit 22 */
#define  CAN_F12R2_FB23                      ((unsigned int)0x00800000)        /*!<Filter bit 23 */
#define  CAN_F12R2_FB24                      ((unsigned int)0x01000000)        /*!<Filter bit 24 */
#define  CAN_F12R2_FB25                      ((unsigned int)0x02000000)        /*!<Filter bit 25 */
#define  CAN_F12R2_FB26                      ((unsigned int)0x04000000)        /*!<Filter bit 26 */
#define  CAN_F12R2_FB27                      ((unsigned int)0x08000000)        /*!<Filter bit 27 */
#define  CAN_F12R2_FB28                      ((unsigned int)0x10000000)        /*!<Filter bit 28 */
#define  CAN_F12R2_FB29                      ((unsigned int)0x20000000)        /*!<Filter bit 29 */
#define  CAN_F12R2_FB30                      ((unsigned int)0x40000000)        /*!<Filter bit 30 */
#define  CAN_F12R2_FB31                      ((unsigned int)0x80000000)        /*!<Filter bit 31 */

/*******************  Bit definition for CAN_F13R2 register  ******************/
#define  CAN_F13R2_FB0                       ((unsigned int)0x00000001)        /*!<Filter bit 0 */
#define  CAN_F13R2_FB1                       ((unsigned int)0x00000002)        /*!<Filter bit 1 */
#define  CAN_F13R2_FB2                       ((unsigned int)0x00000004)        /*!<Filter bit 2 */
#define  CAN_F13R2_FB3                       ((unsigned int)0x00000008)        /*!<Filter bit 3 */
#define  CAN_F13R2_FB4                       ((unsigned int)0x00000010)        /*!<Filter bit 4 */
#define  CAN_F13R2_FB5                       ((unsigned int)0x00000020)        /*!<Filter bit 5 */
#define  CAN_F13R2_FB6                       ((unsigned int)0x00000040)        /*!<Filter bit 6 */
#define  CAN_F13R2_FB7                       ((unsigned int)0x00000080)        /*!<Filter bit 7 */
#define  CAN_F13R2_FB8                       ((unsigned int)0x00000100)        /*!<Filter bit 8 */
#define  CAN_F13R2_FB9                       ((unsigned int)0x00000200)        /*!<Filter bit 9 */
#define  CAN_F13R2_FB10                      ((unsigned int)0x00000400)        /*!<Filter bit 10 */
#define  CAN_F13R2_FB11                      ((unsigned int)0x00000800)        /*!<Filter bit 11 */
#define  CAN_F13R2_FB12                      ((unsigned int)0x00001000)        /*!<Filter bit 12 */
#define  CAN_F13R2_FB13                      ((unsigned int)0x00002000)        /*!<Filter bit 13 */
#define  CAN_F13R2_FB14                      ((unsigned int)0x00004000)        /*!<Filter bit 14 */
#define  CAN_F13R2_FB15                      ((unsigned int)0x00008000)        /*!<Filter bit 15 */
#define  CAN_F13R2_FB16                      ((unsigned int)0x00010000)        /*!<Filter bit 16 */
#define  CAN_F13R2_FB17                      ((unsigned int)0x00020000)        /*!<Filter bit 17 */
#define  CAN_F13R2_FB18                      ((unsigned int)0x00040000)        /*!<Filter bit 18 */
#define  CAN_F13R2_FB19                      ((unsigned int)0x00080000)        /*!<Filter bit 19 */
#define  CAN_F13R2_FB20                      ((unsigned int)0x00100000)        /*!<Filter bit 20 */
#define  CAN_F13R2_FB21                      ((unsigned int)0x00200000)        /*!<Filter bit 21 */
#define  CAN_F13R2_FB22                      ((unsigned int)0x00400000)        /*!<Filter bit 22 */
#define  CAN_F13R2_FB23                      ((unsigned int)0x00800000)        /*!<Filter bit 23 */
#define  CAN_F13R2_FB24                      ((unsigned int)0x01000000)        /*!<Filter bit 24 */
#define  CAN_F13R2_FB25                      ((unsigned int)0x02000000)        /*!<Filter bit 25 */
#define  CAN_F13R2_FB26                      ((unsigned int)0x04000000)        /*!<Filter bit 26 */
#define  CAN_F13R2_FB27                      ((unsigned int)0x08000000)        /*!<Filter bit 27 */
#define  CAN_F13R2_FB28                      ((unsigned int)0x10000000)        /*!<Filter bit 28 */
#define  CAN_F13R2_FB29                      ((unsigned int)0x20000000)        /*!<Filter bit 29 */
#define  CAN_F13R2_FB30                      ((unsigned int)0x40000000)        /*!<Filter bit 30 */
#define  CAN_F13R2_FB31                      ((unsigned int)0x80000000)        /*!<Filter bit 31 */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define  CRC_DR_DR                           ((unsigned int)0xFFFFFFFF) /*!< Data register bits */


/*******************  Bit definition for CRC_IDR register  ********************/
#define  CRC_IDR_IDR                         ((unsigned char)0xFF)        /*!< General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CR register  ********************/
#define  CRC_CR_RESET                        ((unsigned char)0x01)        /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                            Crypto Processor                                */
/*                                                                            */
/******************************************************************************/
/******************* Bits definition for CRYP_CR register  ********************/
#define CRYP_CR_ALGODIR                      ((unsigned int)0x00000004)

#define CRYP_CR_ALGOMODE                     ((unsigned int)0x00080038)
#define CRYP_CR_ALGOMODE_0                   ((unsigned int)0x00000008)
#define CRYP_CR_ALGOMODE_1                   ((unsigned int)0x00000010)
#define CRYP_CR_ALGOMODE_2                   ((unsigned int)0x00000020)
#define CRYP_CR_ALGOMODE_TDES_ECB            ((unsigned int)0x00000000)
#define CRYP_CR_ALGOMODE_TDES_CBC            ((unsigned int)0x00000008)
#define CRYP_CR_ALGOMODE_DES_ECB             ((unsigned int)0x00000010)
#define CRYP_CR_ALGOMODE_DES_CBC             ((unsigned int)0x00000018)
#define CRYP_CR_ALGOMODE_AES_ECB             ((unsigned int)0x00000020)
#define CRYP_CR_ALGOMODE_AES_CBC             ((unsigned int)0x00000028)
#define CRYP_CR_ALGOMODE_AES_CTR             ((unsigned int)0x00000030)
#define CRYP_CR_ALGOMODE_AES_KEY             ((unsigned int)0x00000038)

