raphui/rnk/include/platform/stm32f746.h
#define CRYP_CR_DATATYPE                     ((unsigned int)0x000000C0)
#define CRYP_CR_DATATYPE_0                   ((unsigned int)0x00000040)
#define CRYP_CR_DATATYPE_1                   ((unsigned int)0x00000080)
#define CRYP_CR_KEYSIZE                      ((unsigned int)0x00000300)
#define CRYP_CR_KEYSIZE_0                    ((unsigned int)0x00000100)
#define CRYP_CR_KEYSIZE_1                    ((unsigned int)0x00000200)
#define CRYP_CR_FFLUSH                       ((unsigned int)0x00004000)
#define CRYP_CR_CRYPEN                       ((unsigned int)0x00008000)

#define CRYP_CR_GCM_CCMPH                    ((unsigned int)0x00030000)
#define CRYP_CR_GCM_CCMPH_0                  ((unsigned int)0x00010000)
#define CRYP_CR_GCM_CCMPH_1                  ((unsigned int)0x00020000)
#define CRYP_CR_ALGOMODE_3                   ((unsigned int)0x00080000) 

/****************** Bits definition for CRYP_SR register  *********************/
#define CRYP_SR_IFEM                         ((unsigned int)0x00000001)
#define CRYP_SR_IFNF                         ((unsigned int)0x00000002)
#define CRYP_SR_OFNE                         ((unsigned int)0x00000004)
#define CRYP_SR_OFFU                         ((unsigned int)0x00000008)
#define CRYP_SR_BUSY                         ((unsigned int)0x00000010)
/****************** Bits definition for CRYP_DMACR register  ******************/
#define CRYP_DMACR_DIEN                      ((unsigned int)0x00000001)
#define CRYP_DMACR_DOEN                      ((unsigned int)0x00000002)
/*****************  Bits definition for CRYP_IMSCR register  ******************/
#define CRYP_IMSCR_INIM                      ((unsigned int)0x00000001)
#define CRYP_IMSCR_OUTIM                     ((unsigned int)0x00000002)
/****************** Bits definition for CRYP_RISR register  *******************/
#define CRYP_RISR_OUTRIS                     ((unsigned int)0x00000001)
#define CRYP_RISR_INRIS                      ((unsigned int)0x00000002)
/****************** Bits definition for CRYP_MISR register  *******************/
#define CRYP_MISR_INMIS                      ((unsigned int)0x00000001)
#define CRYP_MISR_OUTMIS                     ((unsigned int)0x00000002)

/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DAC_CR register  ********************/
#define  DAC_CR_EN1                          ((unsigned int)0x00000001)        /*!<DAC channel1 enable */
#define  DAC_CR_BOFF1                        ((unsigned int)0x00000002)        /*!<DAC channel1 output buffer disable */
#define  DAC_CR_TEN1                         ((unsigned int)0x00000004)        /*!<DAC channel1 Trigger enable */

#define  DAC_CR_TSEL1                        ((unsigned int)0x00000038)        /*!<TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_CR_TSEL1_0                      ((unsigned int)0x00000008)        /*!<Bit 0 */
#define  DAC_CR_TSEL1_1                      ((unsigned int)0x00000010)        /*!<Bit 1 */
#define  DAC_CR_TSEL1_2                      ((unsigned int)0x00000020)        /*!<Bit 2 */

#define  DAC_CR_WAVE1                        ((unsigned int)0x000000C0)        /*!<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_CR_WAVE1_0                      ((unsigned int)0x00000040)        /*!<Bit 0 */
#define  DAC_CR_WAVE1_1                      ((unsigned int)0x00000080)        /*!<Bit 1 */

#define  DAC_CR_MAMP1                        ((unsigned int)0x00000F00)        /*!<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define  DAC_CR_MAMP1_0                      ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  DAC_CR_MAMP1_1                      ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  DAC_CR_MAMP1_2                      ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  DAC_CR_MAMP1_3                      ((unsigned int)0x00000800)        /*!<Bit 3 */

#define  DAC_CR_DMAEN1                       ((unsigned int)0x00001000)        /*!<DAC channel1 DMA enable */
#define  DAC_CR_EN2                          ((unsigned int)0x00010000)        /*!<DAC channel2 enable */
#define  DAC_CR_BOFF2                        ((unsigned int)0x00020000)        /*!<DAC channel2 output buffer disable */
#define  DAC_CR_TEN2                         ((unsigned int)0x00040000)        /*!<DAC channel2 Trigger enable */

#define  DAC_CR_TSEL2                        ((unsigned int)0x00380000)        /*!<TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_CR_TSEL2_0                      ((unsigned int)0x00080000)        /*!<Bit 0 */
#define  DAC_CR_TSEL2_1                      ((unsigned int)0x00100000)        /*!<Bit 1 */
#define  DAC_CR_TSEL2_2                      ((unsigned int)0x00200000)        /*!<Bit 2 */

#define  DAC_CR_WAVE2                        ((unsigned int)0x00C00000)        /*!<WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_CR_WAVE2_0                      ((unsigned int)0x00400000)        /*!<Bit 0 */
#define  DAC_CR_WAVE2_1                      ((unsigned int)0x00800000)        /*!<Bit 1 */

#define  DAC_CR_MAMP2                        ((unsigned int)0x0F000000)        /*!<MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_CR_MAMP2_0                      ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  DAC_CR_MAMP2_1                      ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  DAC_CR_MAMP2_2                      ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  DAC_CR_MAMP2_3                      ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  DAC_CR_DMAEN2                       ((unsigned int)0x10000000)        /*!<DAC channel2 DMA enabled */

/*****************  Bit definition for DAC_SWTRIGR register  ******************/
#define  DAC_SWTRIGR_SWTRIG1                 ((unsigned char)0x01)               /*!<DAC channel1 software trigger */
#define  DAC_SWTRIGR_SWTRIG2                 ((unsigned char)0x02)               /*!<DAC channel2 software trigger */

/*****************  Bit definition for DAC_DHR12R1 register  ******************/
#define  DAC_DHR12R1_DACC1DHR                ((unsigned short)0x0FFF)            /*!<DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12L1 register  ******************/
#define  DAC_DHR12L1_DACC1DHR                ((unsigned short)0xFFF0)            /*!<DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8R1 register  ******************/
#define  DAC_DHR8R1_DACC1DHR                 ((unsigned char)0xFF)               /*!<DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12R2 register  ******************/
#define  DAC_DHR12R2_DACC2DHR                ((unsigned short)0x0FFF)            /*!<DAC channel2 12-bit Right aligned data */

