raphui/rnk/include/platform/stm32f746.h
/********************  Bits definition for DMA_LISR register  *****************/ 
#define DMA_LISR_TCIF3                       ((unsigned int)0x08000000)
#define DMA_LISR_HTIF3                       ((unsigned int)0x04000000)
#define DMA_LISR_TEIF3                       ((unsigned int)0x02000000)
#define DMA_LISR_DMEIF3                      ((unsigned int)0x01000000)
#define DMA_LISR_FEIF3                       ((unsigned int)0x00400000)
#define DMA_LISR_TCIF2                       ((unsigned int)0x00200000)
#define DMA_LISR_HTIF2                       ((unsigned int)0x00100000)
#define DMA_LISR_TEIF2                       ((unsigned int)0x00080000)
#define DMA_LISR_DMEIF2                      ((unsigned int)0x00040000)
#define DMA_LISR_FEIF2                       ((unsigned int)0x00010000)
#define DMA_LISR_TCIF1                       ((unsigned int)0x00000800)
#define DMA_LISR_HTIF1                       ((unsigned int)0x00000400)
#define DMA_LISR_TEIF1                       ((unsigned int)0x00000200)
#define DMA_LISR_DMEIF1                      ((unsigned int)0x00000100)
#define DMA_LISR_FEIF1                       ((unsigned int)0x00000040)
#define DMA_LISR_TCIF0                       ((unsigned int)0x00000020)
#define DMA_LISR_HTIF0                       ((unsigned int)0x00000010)
#define DMA_LISR_TEIF0                       ((unsigned int)0x00000008)
#define DMA_LISR_DMEIF0                      ((unsigned int)0x00000004)
#define DMA_LISR_FEIF0                       ((unsigned int)0x00000001)

/********************  Bits definition for DMA_HISR register  *****************/ 
#define DMA_HISR_TCIF7                       ((unsigned int)0x08000000)
#define DMA_HISR_HTIF7                       ((unsigned int)0x04000000)
#define DMA_HISR_TEIF7                       ((unsigned int)0x02000000)
#define DMA_HISR_DMEIF7                      ((unsigned int)0x01000000)
#define DMA_HISR_FEIF7                       ((unsigned int)0x00400000)
#define DMA_HISR_TCIF6                       ((unsigned int)0x00200000)
#define DMA_HISR_HTIF6                       ((unsigned int)0x00100000)
#define DMA_HISR_TEIF6                       ((unsigned int)0x00080000)
#define DMA_HISR_DMEIF6                      ((unsigned int)0x00040000)
#define DMA_HISR_FEIF6                       ((unsigned int)0x00010000)
#define DMA_HISR_TCIF5                       ((unsigned int)0x00000800)
#define DMA_HISR_HTIF5                       ((unsigned int)0x00000400)
#define DMA_HISR_TEIF5                       ((unsigned int)0x00000200)
#define DMA_HISR_DMEIF5                      ((unsigned int)0x00000100)
#define DMA_HISR_FEIF5                       ((unsigned int)0x00000040)
#define DMA_HISR_TCIF4                       ((unsigned int)0x00000020)
#define DMA_HISR_HTIF4                       ((unsigned int)0x00000010)
#define DMA_HISR_TEIF4                       ((unsigned int)0x00000008)
#define DMA_HISR_DMEIF4                      ((unsigned int)0x00000004)
#define DMA_HISR_FEIF4                       ((unsigned int)0x00000001)

/********************  Bits definition for DMA_LIFCR register  ****************/ 
#define DMA_LIFCR_CTCIF3                     ((unsigned int)0x08000000)
#define DMA_LIFCR_CHTIF3                     ((unsigned int)0x04000000)
#define DMA_LIFCR_CTEIF3                     ((unsigned int)0x02000000)
#define DMA_LIFCR_CDMEIF3                    ((unsigned int)0x01000000)
#define DMA_LIFCR_CFEIF3                     ((unsigned int)0x00400000)
#define DMA_LIFCR_CTCIF2                     ((unsigned int)0x00200000)
#define DMA_LIFCR_CHTIF2                     ((unsigned int)0x00100000)
#define DMA_LIFCR_CTEIF2                     ((unsigned int)0x00080000)
#define DMA_LIFCR_CDMEIF2                    ((unsigned int)0x00040000)
#define DMA_LIFCR_CFEIF2                     ((unsigned int)0x00010000)
#define DMA_LIFCR_CTCIF1                     ((unsigned int)0x00000800)
#define DMA_LIFCR_CHTIF1                     ((unsigned int)0x00000400)
#define DMA_LIFCR_CTEIF1                     ((unsigned int)0x00000200)
#define DMA_LIFCR_CDMEIF1                    ((unsigned int)0x00000100)
#define DMA_LIFCR_CFEIF1                     ((unsigned int)0x00000040)
#define DMA_LIFCR_CTCIF0                     ((unsigned int)0x00000020)
#define DMA_LIFCR_CHTIF0                     ((unsigned int)0x00000010)
#define DMA_LIFCR_CTEIF0                     ((unsigned int)0x00000008)
#define DMA_LIFCR_CDMEIF0                    ((unsigned int)0x00000004)
#define DMA_LIFCR_CFEIF0                     ((unsigned int)0x00000001)

/********************  Bits definition for DMA_HIFCR  register  ****************/ 
#define DMA_HIFCR_CTCIF7                     ((unsigned int)0x08000000)
#define DMA_HIFCR_CHTIF7                     ((unsigned int)0x04000000)
#define DMA_HIFCR_CTEIF7                     ((unsigned int)0x02000000)
#define DMA_HIFCR_CDMEIF7                    ((unsigned int)0x01000000)
#define DMA_HIFCR_CFEIF7                     ((unsigned int)0x00400000)
#define DMA_HIFCR_CTCIF6                     ((unsigned int)0x00200000)
#define DMA_HIFCR_CHTIF6                     ((unsigned int)0x00100000)
#define DMA_HIFCR_CTEIF6                     ((unsigned int)0x00080000)
#define DMA_HIFCR_CDMEIF6                    ((unsigned int)0x00040000)
#define DMA_HIFCR_CFEIF6                     ((unsigned int)0x00010000)
#define DMA_HIFCR_CTCIF5                     ((unsigned int)0x00000800)
#define DMA_HIFCR_CHTIF5                     ((unsigned int)0x00000400)
#define DMA_HIFCR_CTEIF5                     ((unsigned int)0x00000200)
#define DMA_HIFCR_CDMEIF5                    ((unsigned int)0x00000100)
#define DMA_HIFCR_CFEIF5                     ((unsigned int)0x00000040)
#define DMA_HIFCR_CTCIF4                     ((unsigned int)0x00000020)
#define DMA_HIFCR_CHTIF4                     ((unsigned int)0x00000010)
#define DMA_HIFCR_CTEIF4                     ((unsigned int)0x00000008)
#define DMA_HIFCR_CDMEIF4                    ((unsigned int)0x00000004)
#define DMA_HIFCR_CFEIF4                     ((unsigned int)0x00000001)

/******************************************************************************/
/*                                                                            */
/*                         AHB Master DMA2D Controller (DMA2D)                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DMA2D_CR register  ******************/

