raphui/rnk/include/platform/stm32f746.h
#define  FMC_BWTR2_CLKDIV                   ((unsigned int)0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BWTR2_CLKDIV_0                 ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_BWTR2_CLKDIV_1                 ((unsigned int)0x00200000)        /*!<Bit 1*/
#define  FMC_BWTR2_CLKDIV_2                 ((unsigned int)0x00400000)        /*!<Bit 2 */
#define  FMC_BWTR2_CLKDIV_3                 ((unsigned int)0x00800000)        /*!<Bit 3 */

#define  FMC_BWTR2_DATLAT                   ((unsigned int)0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BWTR2_DATLAT_0                 ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_BWTR2_DATLAT_1                 ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_BWTR2_DATLAT_2                 ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_BWTR2_DATLAT_3                 ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  FMC_BWTR2_ACCMOD                   ((unsigned int)0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR2_ACCMOD_0                 ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  FMC_BWTR2_ACCMOD_1                 ((unsigned int)0x20000000)        /*!<Bit 1 */

/******************  Bit definition for FMC_BWTR3 register  ******************/
#define  FMC_BWTR3_ADDSET                   ((unsigned int)0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR3_ADDSET_0                 ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_BWTR3_ADDSET_1                 ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_BWTR3_ADDSET_2                 ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_BWTR3_ADDSET_3                 ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_BWTR3_ADDHLD                   ((unsigned int)0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR3_ADDHLD_0                 ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_BWTR3_ADDHLD_1                 ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_BWTR3_ADDHLD_2                 ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_BWTR3_ADDHLD_3                 ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_BWTR3_DATAST                   ((unsigned int)0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR3_DATAST_0                 ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_BWTR3_DATAST_1                 ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_BWTR3_DATAST_2                 ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_BWTR3_DATAST_3                 ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_BWTR3_DATAST_4                 ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_BWTR3_DATAST_5                 ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_BWTR3_DATAST_6                 ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_BWTR3_DATAST_7                 ((unsigned int)0x00008000)        /*!<Bit 7 */

#define  FMC_BWTR3_CLKDIV                   ((unsigned int)0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BWTR3_CLKDIV_0                 ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_BWTR3_CLKDIV_1                 ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_BWTR3_CLKDIV_2                 ((unsigned int)0x00400000)        /*!<Bit 2 */
#define  FMC_BWTR3_CLKDIV_3                 ((unsigned int)0x00800000)        /*!<Bit 3 */

#define  FMC_BWTR3_DATLAT                   ((unsigned int)0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BWTR3_DATLAT_0                 ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_BWTR3_DATLAT_1                 ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_BWTR3_DATLAT_2                 ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_BWTR3_DATLAT_3                 ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  FMC_BWTR3_ACCMOD                   ((unsigned int)0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR3_ACCMOD_0                 ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  FMC_BWTR3_ACCMOD_1                 ((unsigned int)0x20000000)        /*!<Bit 1 */

/******************  Bit definition for FMC_BWTR4 register  ******************/
#define  FMC_BWTR4_ADDSET                   ((unsigned int)0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR4_ADDSET_0                 ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_BWTR4_ADDSET_1                 ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_BWTR4_ADDSET_2                 ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_BWTR4_ADDSET_3                 ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_BWTR4_ADDHLD                   ((unsigned int)0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR4_ADDHLD_0                 ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_BWTR4_ADDHLD_1                 ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_BWTR4_ADDHLD_2                 ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_BWTR4_ADDHLD_3                 ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_BWTR4_DATAST                   ((unsigned int)0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR4_DATAST_0                 ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_BWTR4_DATAST_1                 ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_BWTR4_DATAST_2                 ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_BWTR4_DATAST_3                 ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_BWTR4_DATAST_4                 ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_BWTR4_DATAST_5                 ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_BWTR4_DATAST_6                 ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_BWTR4_DATAST_7                 ((unsigned int)0x00008000)        /*!<Bit 7 */

#define  FMC_BWTR4_CLKDIV                   ((unsigned int)0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BWTR4_CLKDIV_0                 ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_BWTR4_CLKDIV_1                 ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_BWTR4_CLKDIV_2                 ((unsigned int)0x00400000)        /*!<Bit 2 */
#define  FMC_BWTR4_CLKDIV_3                 ((unsigned int)0x00800000)        /*!<Bit 3 */

