raphui/rnk/include/platform/stm32f746.h
#define  FMC_BWTR4_DATLAT                   ((unsigned int)0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BWTR4_DATLAT_0                 ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_BWTR4_DATLAT_1                 ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_BWTR4_DATLAT_2                 ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_BWTR4_DATLAT_3                 ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  FMC_BWTR4_ACCMOD                   ((unsigned int)0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR4_ACCMOD_0                 ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  FMC_BWTR4_ACCMOD_1                 ((unsigned int)0x20000000)        /*!<Bit 1 */

/******************  Bit definition for FMC_PCR2 register  *******************/
#define  FMC_PCR2_PWAITEN                   ((unsigned int)0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR2_PBKEN                     ((unsigned int)0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR2_PTYP                      ((unsigned int)0x00000008)        /*!<Memory type                               */

#define  FMC_PCR2_PWID                      ((unsigned int)0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR2_PWID_0                    ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_PCR2_PWID_1                    ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_PCR2_ECCEN                     ((unsigned int)0x00000040)        /*!<ECC computation logic enable bit          */

#define  FMC_PCR2_TCLR                      ((unsigned int)0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR2_TCLR_0                    ((unsigned int)0x00000200)        /*!<Bit 0 */
#define  FMC_PCR2_TCLR_1                    ((unsigned int)0x00000400)        /*!<Bit 1 */
#define  FMC_PCR2_TCLR_2                    ((unsigned int)0x00000800)        /*!<Bit 2 */
#define  FMC_PCR2_TCLR_3                    ((unsigned int)0x00001000)        /*!<Bit 3 */

#define  FMC_PCR2_TAR                       ((unsigned int)0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR2_TAR_0                     ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  FMC_PCR2_TAR_1                     ((unsigned int)0x00004000)        /*!<Bit 1 */
#define  FMC_PCR2_TAR_2                     ((unsigned int)0x00008000)        /*!<Bit 2 */
#define  FMC_PCR2_TAR_3                     ((unsigned int)0x00010000)        /*!<Bit 3 */

#define  FMC_PCR2_ECCPS                     ((unsigned int)0x000E0000)        /*!<ECCPS[1:0] bits (ECC page size)           */
#define  FMC_PCR2_ECCPS_0                   ((unsigned int)0x00020000)        /*!<Bit 0 */
#define  FMC_PCR2_ECCPS_1                   ((unsigned int)0x00040000)        /*!<Bit 1 */
#define  FMC_PCR2_ECCPS_2                   ((unsigned int)0x00080000)        /*!<Bit 2 */

/******************  Bit definition for FMC_PCR3 register  *******************/
#define  FMC_PCR3_PWAITEN                   ((unsigned int)0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR3_PBKEN                     ((unsigned int)0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR3_PTYP                      ((unsigned int)0x00000008)        /*!<Memory type                               */

#define  FMC_PCR3_PWID                      ((unsigned int)0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR3_PWID_0                    ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_PCR3_PWID_1                    ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_PCR3_ECCEN                     ((unsigned int)0x00000040)        /*!<ECC computation logic enable bit          */

#define  FMC_PCR3_TCLR                      ((unsigned int)0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR3_TCLR_0                    ((unsigned int)0x00000200)        /*!<Bit 0 */
#define  FMC_PCR3_TCLR_1                    ((unsigned int)0x00000400)        /*!<Bit 1 */
#define  FMC_PCR3_TCLR_2                    ((unsigned int)0x00000800)        /*!<Bit 2 */
#define  FMC_PCR3_TCLR_3                    ((unsigned int)0x00001000)        /*!<Bit 3 */

#define  FMC_PCR3_TAR                       ((unsigned int)0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR3_TAR_0                     ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  FMC_PCR3_TAR_1                     ((unsigned int)0x00004000)        /*!<Bit 1 */
#define  FMC_PCR3_TAR_2                     ((unsigned int)0x00008000)        /*!<Bit 2 */
#define  FMC_PCR3_TAR_3                     ((unsigned int)0x00010000)        /*!<Bit 3 */

#define  FMC_PCR3_ECCPS                     ((unsigned int)0x000E0000)        /*!<ECCPS[2:0] bits (ECC page size)           */
#define  FMC_PCR3_ECCPS_0                   ((unsigned int)0x00020000)        /*!<Bit 0 */
#define  FMC_PCR3_ECCPS_1                   ((unsigned int)0x00040000)        /*!<Bit 1 */
#define  FMC_PCR3_ECCPS_2                   ((unsigned int)0x00080000)        /*!<Bit 2 */

/******************  Bit definition for FMC_PCR4 register  *******************/
#define  FMC_PCR4_PWAITEN                   ((unsigned int)0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR4_PBKEN                     ((unsigned int)0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR4_PTYP                      ((unsigned int)0x00000008)        /*!<Memory type                               */

#define  FMC_PCR4_PWID                      ((unsigned int)0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR4_PWID_0                    ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_PCR4_PWID_1                    ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_PCR4_ECCEN                     ((unsigned int)0x00000040)        /*!<ECC computation logic enable bit          */

