raphui/rnk/include/platform/stm32f746.h
#define  FMC_PCR4_TCLR                      ((unsigned int)0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR4_TCLR_0                    ((unsigned int)0x00000200)        /*!<Bit 0 */
#define  FMC_PCR4_TCLR_1                    ((unsigned int)0x00000400)        /*!<Bit 1 */
#define  FMC_PCR4_TCLR_2                    ((unsigned int)0x00000800)        /*!<Bit 2 */
#define  FMC_PCR4_TCLR_3                    ((unsigned int)0x00001000)        /*!<Bit 3 */

#define  FMC_PCR4_TAR                       ((unsigned int)0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR4_TAR_0                     ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  FMC_PCR4_TAR_1                     ((unsigned int)0x00004000)        /*!<Bit 1 */
#define  FMC_PCR4_TAR_2                     ((unsigned int)0x00008000)        /*!<Bit 2 */
#define  FMC_PCR4_TAR_3                     ((unsigned int)0x00010000)        /*!<Bit 3 */

#define  FMC_PCR4_ECCPS                     ((unsigned int)0x000E0000)        /*!<ECCPS[2:0] bits (ECC page size)           */
#define  FMC_PCR4_ECCPS_0                   ((unsigned int)0x00020000)        /*!<Bit 0 */
#define  FMC_PCR4_ECCPS_1                   ((unsigned int)0x00040000)        /*!<Bit 1 */
#define  FMC_PCR4_ECCPS_2                   ((unsigned int)0x00080000)        /*!<Bit 2 */

/*******************  Bit definition for FMC_SR2 register  *******************/
#define  FMC_SR2_IRS                        ((unsigned char)0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR2_ILS                        ((unsigned char)0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR2_IFS                        ((unsigned char)0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR2_IREN                       ((unsigned char)0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR2_ILEN                       ((unsigned char)0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR2_IFEN                       ((unsigned char)0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR2_FEMPT                      ((unsigned char)0x40)               /*!<FIFO empty                                  */

/*******************  Bit definition for FMC_SR3 register  *******************/
#define  FMC_SR3_IRS                        ((unsigned char)0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR3_ILS                        ((unsigned char)0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR3_IFS                        ((unsigned char)0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR3_IREN                       ((unsigned char)0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR3_ILEN                       ((unsigned char)0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR3_IFEN                       ((unsigned char)0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR3_FEMPT                      ((unsigned char)0x40)               /*!<FIFO empty                                  */

/*******************  Bit definition for FMC_SR4 register  *******************/
#define  FMC_SR4_IRS                        ((unsigned char)0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR4_ILS                        ((unsigned char)0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR4_IFS                        ((unsigned char)0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR4_IREN                       ((unsigned char)0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR4_ILEN                       ((unsigned char)0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR4_IFEN                       ((unsigned char)0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR4_FEMPT                      ((unsigned char)0x40)               /*!<FIFO empty                                  */

/******************  Bit definition for FMC_PMEM2 register  ******************/
#define  FMC_PMEM2_MEMSET2                  ((unsigned int)0x000000FF)        /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define  FMC_PMEM2_MEMSET2_0                ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMSET2_1                ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMSET2_2                ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMSET2_3                ((unsigned int)0x00000008)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMSET2_4                ((unsigned int)0x00000010)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMSET2_5                ((unsigned int)0x00000020)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMSET2_6                ((unsigned int)0x00000040)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMSET2_7                ((unsigned int)0x00000080)        /*!<Bit 7 */

#define  FMC_PMEM2_MEMWAIT2                 ((unsigned int)0x0000FF00)        /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define  FMC_PMEM2_MEMWAIT2_0               ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_PMEM2_MEMWAIT2_1               ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_PMEM2_MEMWAIT2_2               ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_PMEM2_MEMWAIT2_3               ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_PMEM2_MEMWAIT2_4               ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_PMEM2_MEMWAIT2_5               ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_PMEM2_MEMWAIT2_6               ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_PMEM2_MEMWAIT2_7               ((unsigned int)0x00008000)        /*!<Bit 7 */

