raphui/rnk/include/platform/stm32f746.h
/******************  Bit definition for FMC_PIO4 register  *******************/
#define  FMC_PIO4_IOSET4                    ((unsigned int)0x000000FF)        /*!<IOSET4[7:0] bits (I/O 4 setup time) */
#define  FMC_PIO4_IOSET4_0                  ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_PIO4_IOSET4_1                  ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_PIO4_IOSET4_2                  ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_PIO4_IOSET4_3                  ((unsigned int)0x00000008)        /*!<Bit 3 */
#define  FMC_PIO4_IOSET4_4                  ((unsigned int)0x00000010)        /*!<Bit 4 */
#define  FMC_PIO4_IOSET4_5                  ((unsigned int)0x00000020)        /*!<Bit 5 */
#define  FMC_PIO4_IOSET4_6                  ((unsigned int)0x00000040)        /*!<Bit 6 */
#define  FMC_PIO4_IOSET4_7                  ((unsigned int)0x00000080)        /*!<Bit 7 */

#define  FMC_PIO4_IOWAIT4                   ((unsigned int)0x0000FF00)        /*!<IOWAIT4[7:0] bits (I/O 4 wait time) */
#define  FMC_PIO4_IOWAIT4_0                 ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_PIO4_IOWAIT4_1                 ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_PIO4_IOWAIT4_2                 ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_PIO4_IOWAIT4_3                 ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_PIO4_IOWAIT4_4                 ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_PIO4_IOWAIT4_5                 ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_PIO4_IOWAIT4_6                 ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_PIO4_IOWAIT4_7                 ((unsigned int)0x00008000)        /*!<Bit 7 */

#define  FMC_PIO4_IOHOLD4                   ((unsigned int)0x00FF0000)        /*!<IOHOLD4[7:0] bits (I/O 4 hold time) */
#define  FMC_PIO4_IOHOLD4_0                 ((unsigned int)0x00010000)        /*!<Bit 0 */
#define  FMC_PIO4_IOHOLD4_1                 ((unsigned int)0x00020000)        /*!<Bit 1 */
#define  FMC_PIO4_IOHOLD4_2                 ((unsigned int)0x00040000)        /*!<Bit 2 */
#define  FMC_PIO4_IOHOLD4_3                 ((unsigned int)0x00080000)        /*!<Bit 3 */
#define  FMC_PIO4_IOHOLD4_4                 ((unsigned int)0x00100000)        /*!<Bit 4 */
#define  FMC_PIO4_IOHOLD4_5                 ((unsigned int)0x00200000)        /*!<Bit 5 */
#define  FMC_PIO4_IOHOLD4_6                 ((unsigned int)0x00400000)        /*!<Bit 6 */
#define  FMC_PIO4_IOHOLD4_7                 ((unsigned int)0x00800000)        /*!<Bit 7 */

#define  FMC_PIO4_IOHIZ4                    ((unsigned int)0xFF000000)        /*!<IOHIZ4[7:0] bits (I/O 4 databus HiZ time) */
#define  FMC_PIO4_IOHIZ4_0                  ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_PIO4_IOHIZ4_1                  ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_PIO4_IOHIZ4_2                  ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_PIO4_IOHIZ4_3                  ((unsigned int)0x08000000)        /*!<Bit 3 */
#define  FMC_PIO4_IOHIZ4_4                  ((unsigned int)0x10000000)        /*!<Bit 4 */
#define  FMC_PIO4_IOHIZ4_5                  ((unsigned int)0x20000000)        /*!<Bit 5 */
#define  FMC_PIO4_IOHIZ4_6                  ((unsigned int)0x40000000)        /*!<Bit 6 */
#define  FMC_PIO4_IOHIZ4_7                  ((unsigned int)0x80000000)        /*!<Bit 7 */

/******************  Bit definition for FMC_ECCR2 register  ******************/
#define  FMC_ECCR2_ECC2                     ((unsigned int)0xFFFFFFFF)        /*!<ECC result */

/******************  Bit definition for FMC_ECCR3 register  ******************/
#define  FMC_ECCR3_ECC3                     ((unsigned int)0xFFFFFFFF)        /*!<ECC result */

/******************  Bit definition for FMC_SDCR1 register  ******************/
#define  FMC_SDCR1_NC                       ((unsigned int)0x00000003)        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR1_NC_0                     ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_SDCR1_NC_1                     ((unsigned int)0x00000002)        /*!<Bit 1 */

#define  FMC_SDCR1_NR                       ((unsigned int)0x0000000C)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_NR_0                     ((unsigned int)0x00000004)        /*!<Bit 0 */
#define  FMC_SDCR1_NR_1                     ((unsigned int)0x00000008)        /*!<Bit 1 */

#define  FMC_SDCR1_MWID                     ((unsigned int)0x00000030)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_MWID_0                   ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_SDCR1_MWID_1                   ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_SDCR1_NB                       ((unsigned int)0x00000040)        /*!<Number of internal bank */

#define  FMC_SDCR1_CAS                      ((unsigned int)0x00000180)        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR1_CAS_0                    ((unsigned int)0x00000080)        /*!<Bit 0 */
#define  FMC_SDCR1_CAS_1                    ((unsigned int)0x00000100)        /*!<Bit 1 */

#define  FMC_SDCR1_WP                       ((unsigned int)0x00000200)        /*!<Write protection */

#define  FMC_SDCR1_SDCLK                    ((unsigned int)0x00000C00)        /*!<SDRAM clock configuration */
#define  FMC_SDCR1_SDCLK_0                  ((unsigned int)0x00000400)        /*!<Bit 0 */
#define  FMC_SDCR1_SDCLK_1                  ((unsigned int)0x00000800)        /*!<Bit 1 */

#define  FMC_SDCR1_RBURST                   ((unsigned int)0x00001000)        /*!<Read burst */

#define  FMC_SDCR1_RPIPE                    ((unsigned int)0x00006000)        /*!<Write protection */
#define  FMC_SDCR1_RPIPE_0                  ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  FMC_SDCR1_RPIPE_1                  ((unsigned int)0x00004000)        /*!<Bit 1 */

/******************  Bit definition for FMC_SDCR2 register  ******************/
#define  FMC_SDCR2_NC                       ((unsigned int)0x00000003)        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR2_NC_0                     ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_SDCR2_NC_1                     ((unsigned int)0x00000002)        /*!<Bit 1 */

#define  FMC_SDCR2_NR                       ((unsigned int)0x0000000C)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_NR_0                     ((unsigned int)0x00000004)        /*!<Bit 0 */
#define  FMC_SDCR2_NR_1                     ((unsigned int)0x00000008)        /*!<Bit 1 */

#define  FMC_SDCR2_MWID                     ((unsigned int)0x00000030)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_MWID_0                   ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_SDCR2_MWID_1                   ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_SDCR2_NB                       ((unsigned int)0x00000040)        /*!<Number of internal bank */

