raphui/rnk/include/platform/stm32f746.h
#define  FMC_SDCR2_CAS                      ((unsigned int)0x00000180)        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR2_CAS_0                    ((unsigned int)0x00000080)        /*!<Bit 0 */
#define  FMC_SDCR2_CAS_1                    ((unsigned int)0x00000100)        /*!<Bit 1 */

#define  FMC_SDCR2_WP                       ((unsigned int)0x00000200)        /*!<Write protection */

#define  FMC_SDCR2_SDCLK                    ((unsigned int)0x00000C00)        /*!<SDCLK[1:0] (SDRAM clock configuration) */
#define  FMC_SDCR2_SDCLK_0                  ((unsigned int)0x00000400)        /*!<Bit 0 */
#define  FMC_SDCR2_SDCLK_1                  ((unsigned int)0x00000800)        /*!<Bit 1 */

#define  FMC_SDCR2_RBURST                   ((unsigned int)0x00001000)        /*!<Read burst */

#define  FMC_SDCR2_RPIPE                    ((unsigned int)0x00006000)        /*!<RPIPE[1:0](Read pipe) */
#define  FMC_SDCR2_RPIPE_0                  ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  FMC_SDCR2_RPIPE_1                  ((unsigned int)0x00004000)        /*!<Bit 1 */

/******************  Bit definition for FMC_SDTR1 register  ******************/
#define  FMC_SDTR1_TMRD                     ((unsigned int)0x0000000F)        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR1_TMRD_0                   ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_SDTR1_TMRD_1                   ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_SDTR1_TMRD_2                   ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_SDTR1_TMRD_3                   ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_SDTR1_TXSR                     ((unsigned int)0x000000F0)        /*!<TXSR[3:0] bits (Exit self refresh) */
#define  FMC_SDTR1_TXSR_0                   ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_SDTR1_TXSR_1                   ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_SDTR1_TXSR_2                   ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_SDTR1_TXSR_3                   ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_SDTR1_TRAS                     ((unsigned int)0x00000F00)        /*!<TRAS[3:0] bits (Self refresh time) */
#define  FMC_SDTR1_TRAS_0                   ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_SDTR1_TRAS_1                   ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_SDTR1_TRAS_2                   ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_SDTR1_TRAS_3                   ((unsigned int)0x00000800)        /*!<Bit 3 */

#define  FMC_SDTR1_TRC                      ((unsigned int)0x0000F000)        /*!<TRC[2:0] bits (Row cycle delay) */
#define  FMC_SDTR1_TRC_0                    ((unsigned int)0x00001000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRC_1                    ((unsigned int)0x00002000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRC_2                    ((unsigned int)0x00004000)        /*!<Bit 2 */

#define  FMC_SDTR1_TWR                      ((unsigned int)0x000F0000)        /*!<TRC[2:0] bits (Write recovery delay) */
#define  FMC_SDTR1_TWR_0                    ((unsigned int)0x00010000)        /*!<Bit 0 */
#define  FMC_SDTR1_TWR_1                    ((unsigned int)0x00020000)        /*!<Bit 1 */
#define  FMC_SDTR1_TWR_2                    ((unsigned int)0x00040000)        /*!<Bit 2 */

#define  FMC_SDTR1_TRP                      ((unsigned int)0x00F00000)        /*!<TRP[2:0] bits (Row precharge delay) */
#define  FMC_SDTR1_TRP_0                    ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRP_1                    ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRP_2                    ((unsigned int)0x00400000)        /*!<Bit 2 */

#define  FMC_SDTR1_TRCD                     ((unsigned int)0x0F000000)        /*!<TRP[2:0] bits (Row to column delay) */
#define  FMC_SDTR1_TRCD_0                   ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRCD_1                   ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRCD_2                   ((unsigned int)0x04000000)        /*!<Bit 2 */

/******************  Bit definition for FMC_SDTR2 register  ******************/
#define  FMC_SDTR2_TMRD                     ((unsigned int)0x0000000F)        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR2_TMRD_0                   ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_SDTR2_TMRD_1                   ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_SDTR2_TMRD_2                   ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_SDTR2_TMRD_3                   ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_SDTR2_TXSR                     ((unsigned int)0x000000F0)        /*!<TXSR[3:0] bits (Exit self refresh) */
#define  FMC_SDTR2_TXSR_0                   ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_SDTR2_TXSR_1                   ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_SDTR2_TXSR_2                   ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_SDTR2_TXSR_3                   ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_SDTR2_TRAS                     ((unsigned int)0x00000F00)        /*!<TRAS[3:0] bits (Self refresh time) */
#define  FMC_SDTR2_TRAS_0                   ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_SDTR2_TRAS_1                   ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_SDTR2_TRAS_2                   ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_SDTR2_TRAS_3                   ((unsigned int)0x00000800)        /*!<Bit 3 */

#define  FMC_SDTR2_TRC                      ((unsigned int)0x0000F000)        /*!<TRC[2:0] bits (Row cycle delay) */
#define  FMC_SDTR2_TRC_0                    ((unsigned int)0x00001000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRC_1                    ((unsigned int)0x00002000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRC_2                    ((unsigned int)0x00004000)        /*!<Bit 2 */

