raphui/rnk/include/platform/stm32f746.h
/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         ((unsigned short)0x0FFF)            /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         ((unsigned char)0x01)               /*!<Watchdog prescaler value update      */
#define  IWDG_SR_RVU                         ((unsigned char)0x02)               /*!<Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                      LCD-TFT Display Controller (LTDC)                     */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for LTDC_SSCR register  *****************/

#define LTDC_SSCR_VSH                       ((unsigned int)0x000007FF)              /*!< Vertical Synchronization Height */
#define LTDC_SSCR_HSW                       ((unsigned int)0x0FFF0000)              /*!< Horizontal Synchronization Width */

/********************  Bit definition for LTDC_BPCR register  *****************/

#define LTDC_BPCR_AVBP                      ((unsigned int)0x000007FF)              /*!< Accumulated Vertical Back Porch */
#define LTDC_BPCR_AHBP                      ((unsigned int)0x0FFF0000)              /*!< Accumulated Horizontal Back Porch */

/********************  Bit definition for LTDC_AWCR register  *****************/

#define LTDC_AWCR_AAH                       ((unsigned int)0x000007FF)              /*!< Accumulated Active heigh */
#define LTDC_AWCR_AAW                       ((unsigned int)0x0FFF0000)              /*!< Accumulated Active Width */

/********************  Bit definition for LTDC_TWCR register  *****************/

#define LTDC_TWCR_TOTALH                    ((unsigned int)0x000007FF)              /*!< Total Heigh */
#define LTDC_TWCR_TOTALW                    ((unsigned int)0x0FFF0000)              /*!< Total Width */

/********************  Bit definition for LTDC_GCR register  ******************/

#define LTDC_GCR_LTDCEN                     ((unsigned int)0x00000001)              /*!< LCD-TFT controller enable bit */
#define LTDC_GCR_DBW                        ((unsigned int)0x00000070)              /*!< Dither Blue Width */
#define LTDC_GCR_DGW                        ((unsigned int)0x00000700)              /*!< Dither Green Width */
#define LTDC_GCR_DRW                        ((unsigned int)0x00007000)              /*!< Dither Red Width */
#define LTDC_GCR_DTEN                       ((unsigned int)0x00010000)              /*!< Dither Enable */
#define LTDC_GCR_PCPOL                      ((unsigned int)0x10000000)              /*!< Pixel Clock Polarity */
#define LTDC_GCR_DEPOL                      ((unsigned int)0x20000000)              /*!< Data Enable Polarity */
#define LTDC_GCR_VSPOL                      ((unsigned int)0x40000000)              /*!< Vertical Synchronization Polarity */
#define LTDC_GCR_HSPOL                      ((unsigned int)0x80000000)              /*!< Horizontal Synchronization Polarity */

/********************  Bit definition for LTDC_SRCR register  *****************/

#define LTDC_SRCR_IMR                      ((unsigned int)0x00000001)               /*!< Immediate Reload */
#define LTDC_SRCR_VBR                      ((unsigned int)0x00000002)               /*!< Vertical Blanking Reload */

/********************  Bit definition for LTDC_BCCR register  *****************/

#define LTDC_BCCR_BCBLUE                    ((unsigned int)0x000000FF)              /*!< Background Blue value */
#define LTDC_BCCR_BCGREEN                   ((unsigned int)0x0000FF00)              /*!< Background Green value */
#define LTDC_BCCR_BCRED                     ((unsigned int)0x00FF0000)              /*!< Background Red value */

/********************  Bit definition for LTDC_IER register  ******************/

#define LTDC_IER_LIE                        ((unsigned int)0x00000001)              /*!< Line Interrupt Enable */
#define LTDC_IER_FUIE                       ((unsigned int)0x00000002)              /*!< FIFO Underrun Interrupt Enable */
#define LTDC_IER_TERRIE                     ((unsigned int)0x00000004)              /*!< Transfer Error Interrupt Enable */
#define LTDC_IER_RRIE                       ((unsigned int)0x00000008)              /*!< Register Reload interrupt enable */

/********************  Bit definition for LTDC_ISR register  ******************/

#define LTDC_ISR_LIF                        ((unsigned int)0x00000001)              /*!< Line Interrupt Flag */
#define LTDC_ISR_FUIF                       ((unsigned int)0x00000002)              /*!< FIFO Underrun Interrupt Flag */
#define LTDC_ISR_TERRIF                     ((unsigned int)0x00000004)              /*!< Transfer Error Interrupt Flag */
#define LTDC_ISR_RRIF                       ((unsigned int)0x00000008)              /*!< Register Reload interrupt Flag */

/********************  Bit definition for LTDC_ICR register  ******************/

#define LTDC_ICR_CLIF                       ((unsigned int)0x00000001)              /*!< Clears the Line Interrupt Flag */
#define LTDC_ICR_CFUIF                      ((unsigned int)0x00000002)              /*!< Clears the FIFO Underrun Interrupt Flag */
#define LTDC_ICR_CTERRIF                    ((unsigned int)0x00000004)              /*!< Clears the Transfer Error Interrupt Flag */
#define LTDC_ICR_CRRIF                      ((unsigned int)0x00000008)              /*!< Clears Register Reload interrupt Flag */

/********************  Bit definition for LTDC_LIPCR register  ****************/

#define LTDC_LIPCR_LIPOS                    ((unsigned int)0x000007FF)              /*!< Line Interrupt Position */

/********************  Bit definition for LTDC_CPSR register  *****************/

#define LTDC_CPSR_CYPOS                     ((unsigned int)0x0000FFFF)              /*!< Current Y Position */
#define LTDC_CPSR_CXPOS                     ((unsigned int)0xFFFF0000)              /*!< Current X Position */

/********************  Bit definition for LTDC_CDSR register  *****************/

#define LTDC_CDSR_VDES                      ((unsigned int)0x00000001)              /*!< Vertical Data Enable Status */
#define LTDC_CDSR_HDES                      ((unsigned int)0x00000002)              /*!< Horizontal Data Enable Status */
#define LTDC_CDSR_VSYNCS                    ((unsigned int)0x00000004)              /*!< Vertical Synchronization Status */
#define LTDC_CDSR_HSYNCS                    ((unsigned int)0x00000008)              /*!< Horizontal Synchronization Status */

