raphui/rnk/include/platform/stm32f746.h
#define  PWR_CR_VOS                          ((unsigned int)0x0000C000)     /*!< VOS[1:0] bits (Regulator voltage scaling output selection) */
#define  PWR_CR_VOS_0                        ((unsigned int)0x00004000)     /*!< Bit 0 */
#define  PWR_CR_VOS_1                        ((unsigned int)0x00008000)     /*!< Bit 1 */

#define  PWR_CR_ODEN                         ((unsigned int)0x00010000)     /*!< Over Drive enable                   */
#define  PWR_CR_ODSWEN                       ((unsigned int)0x00020000)     /*!< Over Drive switch enabled           */
#define  PWR_CR_UDEN                         ((unsigned int)0x000C0000)     /*!< Under Drive enable in stop mode     */
#define  PWR_CR_UDEN_0                       ((unsigned int)0x00040000)     /*!< Bit 0                               */
#define  PWR_CR_UDEN_1                       ((unsigned int)0x00080000)     /*!< Bit 1                               */

#define  PWR_CR_FMSSR                        ((unsigned int)0x00100000)     /*!< Flash Memory Sleep System Run        */
#define  PWR_CR_FISSR                        ((unsigned int)0x00200000)     /*!< Flash Interface Stop while System Run */

/* Legacy define */
#define  PWR_CR_PMODE                        PWR_CR_VOS

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                         ((unsigned int)0x00000001)     /*!< Wakeup Flag                                      */
#define  PWR_CSR_SBF                         ((unsigned int)0x00000002)     /*!< Standby Flag                                     */
#define  PWR_CSR_PVDO                        ((unsigned int)0x00000004)     /*!< PVD Output                                       */
#define  PWR_CSR_BRR                         ((unsigned int)0x00000008)     /*!< Backup regulator ready                           */
#define  PWR_CSR_WUPP                        ((unsigned int)0x00000080)     /*!< WKUP pin Polarity                                */
#define  PWR_CSR_EWUP                        ((unsigned int)0x00000100)     /*!< Enable WKUP pin                                  */
#define  PWR_CSR_BRE                         ((unsigned int)0x00000200)     /*!< Backup regulator enable                          */
#define  PWR_CSR_VOSRDY                      ((unsigned int)0x00004000)     /*!< Regulator voltage scaling output selection ready */
#define  PWR_CSR_ODRDY                       ((unsigned int)0x00010000)     /*!< Over Drive generator ready                       */
#define  PWR_CSR_ODSWRDY                     ((unsigned int)0x00020000)     /*!< Over Drive Switch ready                          */
#define  PWR_CSR_UDSWRDY                     ((unsigned int)0x000C0000)     /*!< Under Drive ready                                */

/* Legacy define */
#define  PWR_CSR_REGRDY                      PWR_CSR_VOSRDY

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ((unsigned int)0x00000001)
#define  RCC_CR_HSIRDY                       ((unsigned int)0x00000002)

#define  RCC_CR_HSITRIM                      ((unsigned int)0x000000F8)
#define  RCC_CR_HSITRIM_0                    ((unsigned int)0x00000008)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1                    ((unsigned int)0x00000010)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2                    ((unsigned int)0x00000020)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3                    ((unsigned int)0x00000040)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4                    ((unsigned int)0x00000080)/*!<Bit 4 */

#define  RCC_CR_HSICAL                       ((unsigned int)0x0000FF00)
#define  RCC_CR_HSICAL_0                     ((unsigned int)0x00000100)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                     ((unsigned int)0x00000200)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                     ((unsigned int)0x00000400)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                     ((unsigned int)0x00000800)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                     ((unsigned int)0x00001000)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                     ((unsigned int)0x00002000)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                     ((unsigned int)0x00004000)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                     ((unsigned int)0x00008000)/*!<Bit 7 */

#define  RCC_CR_HSEON                        ((unsigned int)0x00010000)
#define  RCC_CR_HSERDY                       ((unsigned int)0x00020000)
#define  RCC_CR_HSEBYP                       ((unsigned int)0x00040000)
#define  RCC_CR_CSSON                        ((unsigned int)0x00080000)
#define  RCC_CR_PLLON                        ((unsigned int)0x01000000)
#define  RCC_CR_PLLRDY                       ((unsigned int)0x02000000)
#define  RCC_CR_PLLI2SON                     ((unsigned int)0x04000000)
#define  RCC_CR_PLLI2SRDY                    ((unsigned int)0x08000000)
#define  RCC_CR_PLLSAION                     ((unsigned int)0x10000000)
#define  RCC_CR_PLLSAIRDY                    ((unsigned int)0x20000000)

/********************  Bit definition for RCC_PLLCFGR register  ***************/
#define  RCC_PLLCFGR_PLLM                    ((unsigned int)0x0000003F)
#define  RCC_PLLCFGR_PLLM_0                  ((unsigned int)0x00000001)
#define  RCC_PLLCFGR_PLLM_1                  ((unsigned int)0x00000002)
#define  RCC_PLLCFGR_PLLM_2                  ((unsigned int)0x00000004)
#define  RCC_PLLCFGR_PLLM_3                  ((unsigned int)0x00000008)
#define  RCC_PLLCFGR_PLLM_4                  ((unsigned int)0x00000010)
#define  RCC_PLLCFGR_PLLM_5                  ((unsigned int)0x00000020)

