raphui/rnk/include/platform/stm32f746.h
/*!< RTCPRE configuration */
#define  RCC_CFGR_RTCPRE                     ((unsigned int)0x001F0000)
#define  RCC_CFGR_RTCPRE_0                   ((unsigned int)0x00010000)
#define  RCC_CFGR_RTCPRE_1                   ((unsigned int)0x00020000)
#define  RCC_CFGR_RTCPRE_2                   ((unsigned int)0x00040000)
#define  RCC_CFGR_RTCPRE_3                   ((unsigned int)0x00080000)
#define  RCC_CFGR_RTCPRE_4                   ((unsigned int)0x00100000)

/*!< MCO1 configuration */
#define  RCC_CFGR_MCO1                       ((unsigned int)0x00600000)
#define  RCC_CFGR_MCO1_0                     ((unsigned int)0x00200000)
#define  RCC_CFGR_MCO1_1                     ((unsigned int)0x00400000)

#define  RCC_CFGR_I2SSRC                     ((unsigned int)0x00800000)

#define  RCC_CFGR_MCO1PRE                    ((unsigned int)0x07000000)
#define  RCC_CFGR_MCO1PRE_0                  ((unsigned int)0x01000000)
#define  RCC_CFGR_MCO1PRE_1                  ((unsigned int)0x02000000)
#define  RCC_CFGR_MCO1PRE_2                  ((unsigned int)0x04000000)

#define  RCC_CFGR_MCO2PRE                    ((unsigned int)0x38000000)
#define  RCC_CFGR_MCO2PRE_0                  ((unsigned int)0x08000000)
#define  RCC_CFGR_MCO2PRE_1                  ((unsigned int)0x10000000)
#define  RCC_CFGR_MCO2PRE_2                  ((unsigned int)0x20000000)

#define  RCC_CFGR_MCO2                       ((unsigned int)0xC0000000)
#define  RCC_CFGR_MCO2_0                     ((unsigned int)0x40000000)
#define  RCC_CFGR_MCO2_1                     ((unsigned int)0x80000000)

/********************  Bit definition for RCC_CIR register  *******************/
#define  RCC_CIR_LSIRDYF                     ((unsigned int)0x00000001)
#define  RCC_CIR_LSERDYF                     ((unsigned int)0x00000002)
#define  RCC_CIR_HSIRDYF                     ((unsigned int)0x00000004)
#define  RCC_CIR_HSERDYF                     ((unsigned int)0x00000008)
#define  RCC_CIR_PLLRDYF                     ((unsigned int)0x00000010)
#define  RCC_CIR_PLLI2SRDYF                  ((unsigned int)0x00000020)
#define  RCC_CIR_PLLSAIRDYF                  ((unsigned int)0x00000040)
#define  RCC_CIR_CSSF                        ((unsigned int)0x00000080)
#define  RCC_CIR_LSIRDYIE                    ((unsigned int)0x00000100)
#define  RCC_CIR_LSERDYIE                    ((unsigned int)0x00000200)
#define  RCC_CIR_HSIRDYIE                    ((unsigned int)0x00000400)
#define  RCC_CIR_HSERDYIE                    ((unsigned int)0x00000800)
#define  RCC_CIR_PLLRDYIE                    ((unsigned int)0x00001000)
#define  RCC_CIR_PLLI2SRDYIE                 ((unsigned int)0x00002000)
#define  RCC_CIR_PLLSAIRDYIE                 ((unsigned int)0x00004000)
#define  RCC_CIR_LSIRDYC                     ((unsigned int)0x00010000)
#define  RCC_CIR_LSERDYC                     ((unsigned int)0x00020000)
#define  RCC_CIR_HSIRDYC                     ((unsigned int)0x00040000)
#define  RCC_CIR_HSERDYC                     ((unsigned int)0x00080000)
#define  RCC_CIR_PLLRDYC                     ((unsigned int)0x00100000)
#define  RCC_CIR_PLLI2SRDYC                  ((unsigned int)0x00200000)
#define  RCC_CIR_PLLSAIRDYC                  ((unsigned int)0x00400000)
#define  RCC_CIR_CSSC                        ((unsigned int)0x00800000)

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_GPIOARST               ((unsigned int)0x00000001)
#define  RCC_AHB1RSTR_GPIOBRST               ((unsigned int)0x00000002)
#define  RCC_AHB1RSTR_GPIOCRST               ((unsigned int)0x00000004)
#define  RCC_AHB1RSTR_GPIODRST               ((unsigned int)0x00000008)
#define  RCC_AHB1RSTR_GPIOERST               ((unsigned int)0x00000010)
#define  RCC_AHB1RSTR_GPIOFRST               ((unsigned int)0x00000020)
#define  RCC_AHB1RSTR_GPIOGRST               ((unsigned int)0x00000040)
#define  RCC_AHB1RSTR_GPIOHRST               ((unsigned int)0x00000080)
#define  RCC_AHB1RSTR_GPIOIRST               ((unsigned int)0x00000100)
#define  RCC_AHB1RSTR_GPIOJRST               ((unsigned int)0x00000200)
#define  RCC_AHB1RSTR_GPIOKRST               ((unsigned int)0x00000400)
#define  RCC_AHB1RSTR_CRCRST                 ((unsigned int)0x00001000)
#define  RCC_AHB1RSTR_DMA1RST                ((unsigned int)0x00200000)
#define  RCC_AHB1RSTR_DMA2RST                ((unsigned int)0x00400000)
#define  RCC_AHB1RSTR_DMA2DRST               ((unsigned int)0x00800000)
#define  RCC_AHB1RSTR_ETHMACRST              ((unsigned int)0x02000000)
#define  RCC_AHB1RSTR_OTGHRST                ((unsigned int)0x10000000)

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_DCMIRST                ((unsigned int)0x00000001)
#define  RCC_AHB2RSTR_CRYPRST                ((unsigned int)0x00000010)
#define  RCC_AHB2RSTR_HASHRST                ((unsigned int)0x00000020)
/* maintained for legacy purpose */
#define  RCC_AHB2RSTR_HSAHRST                RCC_AHB2RSTR_HASHRST
#define  RCC_AHB2RSTR_RNGRST                 ((unsigned int)0x00000040)
#define  RCC_AHB2RSTR_OTGFSRST               ((unsigned int)0x00000080)

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#define  RCC_AHB3RSTR_FMCRST                ((unsigned int)0x00000001)

/********************  Bit definition for RCC_APB1RSTR register  **************/
#define  RCC_APB1RSTR_TIM2RST                ((unsigned int)0x00000001)
#define  RCC_APB1RSTR_TIM3RST                ((unsigned int)0x00000002)
#define  RCC_APB1RSTR_TIM4RST                ((unsigned int)0x00000004)
#define  RCC_APB1RSTR_TIM5RST                ((unsigned int)0x00000008)
#define  RCC_APB1RSTR_TIM6RST                ((unsigned int)0x00000010)
#define  RCC_APB1RSTR_TIM7RST                ((unsigned int)0x00000020)
#define  RCC_APB1RSTR_TIM12RST               ((unsigned int)0x00000040)
#define  RCC_APB1RSTR_TIM13RST               ((unsigned int)0x00000080)
#define  RCC_APB1RSTR_TIM14RST               ((unsigned int)0x00000100)
#define  RCC_APB1RSTR_WWDGRST                ((unsigned int)0x00000800)
#define  RCC_APB1RSTR_SPI2RST                ((unsigned int)0x00004000)
#define  RCC_APB1RSTR_SPI3RST                ((unsigned int)0x00008000)
#define  RCC_APB1RSTR_USART2RST              ((unsigned int)0x00020000)
#define  RCC_APB1RSTR_USART3RST              ((unsigned int)0x00040000)
#define  RCC_APB1RSTR_UART4RST               ((unsigned int)0x00080000)
#define  RCC_APB1RSTR_UART5RST               ((unsigned int)0x00100000)
#define  RCC_APB1RSTR_I2C1RST                ((unsigned int)0x00200000)
#define  RCC_APB1RSTR_I2C2RST                ((unsigned int)0x00400000)
#define  RCC_APB1RSTR_I2C3RST                ((unsigned int)0x00800000)
#define  RCC_APB1RSTR_CAN1RST                ((unsigned int)0x02000000)
#define  RCC_APB1RSTR_CAN2RST                ((unsigned int)0x04000000)
#define  RCC_APB1RSTR_PWRRST                 ((unsigned int)0x10000000)
#define  RCC_APB1RSTR_DACRST                 ((unsigned int)0x20000000)
#define  RCC_APB1RSTR_UART7RST               ((unsigned int)0x40000000)
#define  RCC_APB1RSTR_UART8RST               ((unsigned int)0x80000000)

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_TIM1RST                ((unsigned int)0x00000001)
#define  RCC_APB2RSTR_TIM8RST                ((unsigned int)0x00000002)
#define  RCC_APB2RSTR_USART1RST              ((unsigned int)0x00000010)
#define  RCC_APB2RSTR_USART6RST              ((unsigned int)0x00000020)
#define  RCC_APB2RSTR_ADCRST                 ((unsigned int)0x00000100)
#define  RCC_APB2RSTR_SDIORST                ((unsigned int)0x00000800)
#define  RCC_APB2RSTR_SPI1RST                ((unsigned int)0x00001000)
#define  RCC_APB2RSTR_SPI4RST                ((unsigned int)0x00002000)
#define  RCC_APB2RSTR_SYSCFGRST              ((unsigned int)0x00004000)
#define  RCC_APB2RSTR_TIM9RST                ((unsigned int)0x00010000)
#define  RCC_APB2RSTR_TIM10RST               ((unsigned int)0x00020000)
#define  RCC_APB2RSTR_TIM11RST               ((unsigned int)0x00040000)
#define  RCC_APB2RSTR_SPI5RST                ((unsigned int)0x00100000)
#define  RCC_APB2RSTR_SPI6RST                ((unsigned int)0x00200000)
#define  RCC_APB2RSTR_SAI1RST                ((unsigned int)0x00400000)
#define  RCC_APB2RSTR_LTDCRST                ((unsigned int)0x04000000)

/* Old SPI1RST bit definition, maintained for legacy purpose */
#define  RCC_APB2RSTR_SPI1                   RCC_APB2RSTR_SPI1RST

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_GPIOAEN                 ((unsigned int)0x00000001)
#define  RCC_AHB1ENR_GPIOBEN                 ((unsigned int)0x00000002)
#define  RCC_AHB1ENR_GPIOCEN                 ((unsigned int)0x00000004)
#define  RCC_AHB1ENR_GPIODEN                 ((unsigned int)0x00000008)
#define  RCC_AHB1ENR_GPIOEEN                 ((unsigned int)0x00000010)
#define  RCC_AHB1ENR_GPIOFEN                 ((unsigned int)0x00000020)
#define  RCC_AHB1ENR_GPIOGEN                 ((unsigned int)0x00000040)
#define  RCC_AHB1ENR_GPIOHEN                 ((unsigned int)0x00000080)
#define  RCC_AHB1ENR_GPIOIEN                 ((unsigned int)0x00000100)
#define  RCC_AHB1ENR_GPIOJEN                 ((unsigned int)0x00000200)
#define  RCC_AHB1ENR_GPIOKEN                 ((unsigned int)0x00000400)
#define  RCC_AHB1ENR_CRCEN                   ((unsigned int)0x00001000)
#define  RCC_AHB1ENR_BKPSRAMEN               ((unsigned int)0x00040000)
#define  RCC_AHB1ENR_CCMDATARAMEN            ((unsigned int)0x00100000)
#define  RCC_AHB1ENR_DMA1EN                  ((unsigned int)0x00200000)
#define  RCC_AHB1ENR_DMA2EN                  ((unsigned int)0x00400000)
#define  RCC_AHB1ENR_DMA2DEN                 ((unsigned int)0x00800000)
#define  RCC_AHB1ENR_ETHMACEN                ((unsigned int)0x02000000)
#define  RCC_AHB1ENR_ETHMACTXEN              ((unsigned int)0x04000000)
#define  RCC_AHB1ENR_ETHMACRXEN              ((unsigned int)0x08000000)
#define  RCC_AHB1ENR_ETHMACPTPEN             ((unsigned int)0x10000000)
#define  RCC_AHB1ENR_OTGHSEN                 ((unsigned int)0x20000000)
#define  RCC_AHB1ENR_OTGHSULPIEN             ((unsigned int)0x40000000)

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_DCMIEN                  ((unsigned int)0x00000001)
#define  RCC_AHB2ENR_CRYPEN                  ((unsigned int)0x00000010)
#define  RCC_AHB2ENR_HASHEN                  ((unsigned int)0x00000020)
#define  RCC_AHB2ENR_RNGEN                   ((unsigned int)0x00000040)
#define  RCC_AHB2ENR_OTGFSEN                 ((unsigned int)0x00000080)

