raphui/rnk/include/platform/stm32f746.h
/********************  Bit definition for RCC_AHB3ENR register  ***************/
#define  RCC_AHB3ENR_FMCEN                  ((unsigned int)0x00000001)

/********************  Bit definition for RCC_APB1ENR register  ***************/
#define  RCC_APB1ENR_TIM2EN                  ((unsigned int)0x00000001)
#define  RCC_APB1ENR_TIM3EN                  ((unsigned int)0x00000002)
#define  RCC_APB1ENR_TIM4EN                  ((unsigned int)0x00000004)
#define  RCC_APB1ENR_TIM5EN                  ((unsigned int)0x00000008)
#define  RCC_APB1ENR_TIM6EN                  ((unsigned int)0x00000010)
#define  RCC_APB1ENR_TIM7EN                  ((unsigned int)0x00000020)
#define  RCC_APB1ENR_TIM12EN                 ((unsigned int)0x00000040)
#define  RCC_APB1ENR_TIM13EN                 ((unsigned int)0x00000080)
#define  RCC_APB1ENR_TIM14EN                 ((unsigned int)0x00000100)
#define  RCC_APB1ENR_WWDGEN                  ((unsigned int)0x00000800)
#define  RCC_APB1ENR_SPI2EN                  ((unsigned int)0x00004000)
#define  RCC_APB1ENR_SPI3EN                  ((unsigned int)0x00008000)
#define  RCC_APB1ENR_USART2EN                ((unsigned int)0x00020000)
#define  RCC_APB1ENR_USART3EN                ((unsigned int)0x00040000)
#define  RCC_APB1ENR_UART4EN                 ((unsigned int)0x00080000)
#define  RCC_APB1ENR_UART5EN                 ((unsigned int)0x00100000)
#define  RCC_APB1ENR_I2C1EN                  ((unsigned int)0x00200000)
#define  RCC_APB1ENR_I2C2EN                  ((unsigned int)0x00400000)
#define  RCC_APB1ENR_I2C3EN                  ((unsigned int)0x00800000)
#define  RCC_APB1ENR_CAN1EN                  ((unsigned int)0x02000000)
#define  RCC_APB1ENR_CAN2EN                  ((unsigned int)0x04000000)
#define  RCC_APB1ENR_PWREN                   ((unsigned int)0x10000000)
#define  RCC_APB1ENR_DACEN                   ((unsigned int)0x20000000)
#define  RCC_APB1ENR_UART7EN                 ((unsigned int)0x40000000)
#define  RCC_APB1ENR_UART8EN                 ((unsigned int)0x80000000)

/********************  Bit definition for RCC_APB2ENR register  ***************/
#define  RCC_APB2ENR_TIM1EN                  ((unsigned int)0x00000001)
#define  RCC_APB2ENR_TIM8EN                  ((unsigned int)0x00000002)
#define  RCC_APB2ENR_USART1EN                ((unsigned int)0x00000010)
#define  RCC_APB2ENR_USART6EN                ((unsigned int)0x00000020)
#define  RCC_APB2ENR_ADC1EN                  ((unsigned int)0x00000100)
#define  RCC_APB2ENR_ADC2EN                  ((unsigned int)0x00000200)
#define  RCC_APB2ENR_ADC3EN                  ((unsigned int)0x00000400)
#define  RCC_APB2ENR_SDIOEN                  ((unsigned int)0x00000800)
#define  RCC_APB2ENR_SPI1EN                  ((unsigned int)0x00001000)
#define  RCC_APB2ENR_SPI4EN                  ((unsigned int)0x00002000)
#define  RCC_APB2ENR_SYSCFGEN                ((unsigned int)0x00004000)
#define  RCC_APB2ENR_TIM9EN                  ((unsigned int)0x00010000)
#define  RCC_APB2ENR_TIM10EN                 ((unsigned int)0x00020000)
#define  RCC_APB2ENR_TIM11EN                 ((unsigned int)0x00040000)
#define  RCC_APB2ENR_SPI5EN                  ((unsigned int)0x00100000)
#define  RCC_APB2ENR_SPI6EN                  ((unsigned int)0x00200000)
#define  RCC_APB2ENR_SAI1EN                  ((unsigned int)0x00400000)
#define  RCC_APB2ENR_LTDCEN                  ((unsigned int)0x04000000)

/********************  Bit definition for RCC_AHB1LPENR register  *************/
#define  RCC_AHB1LPENR_GPIOALPEN             ((unsigned int)0x00000001)
#define  RCC_AHB1LPENR_GPIOBLPEN             ((unsigned int)0x00000002)
#define  RCC_AHB1LPENR_GPIOCLPEN             ((unsigned int)0x00000004)
#define  RCC_AHB1LPENR_GPIODLPEN             ((unsigned int)0x00000008)
#define  RCC_AHB1LPENR_GPIOELPEN             ((unsigned int)0x00000010)
#define  RCC_AHB1LPENR_GPIOFLPEN             ((unsigned int)0x00000020)
#define  RCC_AHB1LPENR_GPIOGLPEN             ((unsigned int)0x00000040)
#define  RCC_AHB1LPENR_GPIOHLPEN             ((unsigned int)0x00000080)
#define  RCC_AHB1LPENR_GPIOILPEN             ((unsigned int)0x00000100)
#define  RCC_AHB1LPENR_GPIOJLPEN             ((unsigned int)0x00000200)
#define  RCC_AHB1LPENR_GPIOKLPEN             ((unsigned int)0x00000400)
#define  RCC_AHB1LPENR_CRCLPEN               ((unsigned int)0x00001000)
#define  RCC_AHB1LPENR_FLITFLPEN             ((unsigned int)0x00008000)
#define  RCC_AHB1LPENR_SRAM1LPEN             ((unsigned int)0x00010000)
#define  RCC_AHB1LPENR_SRAM2LPEN             ((unsigned int)0x00020000)
#define  RCC_AHB1LPENR_BKPSRAMLPEN           ((unsigned int)0x00040000)
#define  RCC_AHB1LPENR_SRAM3LPEN             ((unsigned int)0x00080000)
#define  RCC_AHB1LPENR_DMA1LPEN              ((unsigned int)0x00200000)
#define  RCC_AHB1LPENR_DMA2LPEN              ((unsigned int)0x00400000)
#define  RCC_AHB1LPENR_DMA2DLPEN             ((unsigned int)0x00800000)
#define  RCC_AHB1LPENR_ETHMACLPEN            ((unsigned int)0x02000000)
#define  RCC_AHB1LPENR_ETHMACTXLPEN          ((unsigned int)0x04000000)
#define  RCC_AHB1LPENR_ETHMACRXLPEN          ((unsigned int)0x08000000)
#define  RCC_AHB1LPENR_ETHMACPTPLPEN         ((unsigned int)0x10000000)
#define  RCC_AHB1LPENR_OTGHSLPEN             ((unsigned int)0x20000000)
#define  RCC_AHB1LPENR_OTGHSULPILPEN         ((unsigned int)0x40000000)

/********************  Bit definition for RCC_AHB2LPENR register  *************/
#define  RCC_AHB2LPENR_DCMILPEN              ((unsigned int)0x00000001)
#define  RCC_AHB2LPENR_CRYPLPEN              ((unsigned int)0x00000010)
#define  RCC_AHB2LPENR_HASHLPEN              ((unsigned int)0x00000020)
#define  RCC_AHB2LPENR_RNGLPEN               ((unsigned int)0x00000040)
#define  RCC_AHB2LPENR_OTGFSLPEN             ((unsigned int)0x00000080)

/********************  Bit definition for RCC_AHB3LPENR register  *************/
#define  RCC_AHB3LPENR_FMCLPEN              ((unsigned int)0x00000001)

/********************  Bit definition for RCC_APB1LPENR register  *************/
#define  RCC_APB1LPENR_TIM2LPEN              ((unsigned int)0x00000001)
#define  RCC_APB1LPENR_TIM3LPEN              ((unsigned int)0x00000002)
#define  RCC_APB1LPENR_TIM4LPEN              ((unsigned int)0x00000004)
#define  RCC_APB1LPENR_TIM5LPEN              ((unsigned int)0x00000008)
#define  RCC_APB1LPENR_TIM6LPEN              ((unsigned int)0x00000010)
#define  RCC_APB1LPENR_TIM7LPEN              ((unsigned int)0x00000020)
#define  RCC_APB1LPENR_TIM12LPEN             ((unsigned int)0x00000040)
#define  RCC_APB1LPENR_TIM13LPEN             ((unsigned int)0x00000080)
#define  RCC_APB1LPENR_TIM14LPEN             ((unsigned int)0x00000100)
#define  RCC_APB1LPENR_WWDGLPEN              ((unsigned int)0x00000800)
#define  RCC_APB1LPENR_SPI2LPEN              ((unsigned int)0x00004000)
#define  RCC_APB1LPENR_SPI3LPEN              ((unsigned int)0x00008000)
#define  RCC_APB1LPENR_USART2LPEN            ((unsigned int)0x00020000)
#define  RCC_APB1LPENR_USART3LPEN            ((unsigned int)0x00040000)
#define  RCC_APB1LPENR_UART4LPEN             ((unsigned int)0x00080000)
#define  RCC_APB1LPENR_UART5LPEN             ((unsigned int)0x00100000)
#define  RCC_APB1LPENR_I2C1LPEN              ((unsigned int)0x00200000)
#define  RCC_APB1LPENR_I2C2LPEN              ((unsigned int)0x00400000)
#define  RCC_APB1LPENR_I2C3LPEN              ((unsigned int)0x00800000)
#define  RCC_APB1LPENR_CAN1LPEN              ((unsigned int)0x02000000)
#define  RCC_APB1LPENR_CAN2LPEN              ((unsigned int)0x04000000)
#define  RCC_APB1LPENR_PWRLPEN               ((unsigned int)0x10000000)
#define  RCC_APB1LPENR_DACLPEN               ((unsigned int)0x20000000)
#define  RCC_APB1LPENR_UART7LPEN             ((unsigned int)0x40000000)
#define  RCC_APB1LPENR_UART8LPEN             ((unsigned int)0x80000000)

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define  RCC_APB2LPENR_TIM1LPEN              ((unsigned int)0x00000001)
#define  RCC_APB2LPENR_TIM8LPEN              ((unsigned int)0x00000002)
#define  RCC_APB2LPENR_USART1LPEN            ((unsigned int)0x00000010)
#define  RCC_APB2LPENR_USART6LPEN            ((unsigned int)0x00000020)
#define  RCC_APB2LPENR_ADC1LPEN              ((unsigned int)0x00000100)
#define  RCC_APB2LPENR_ADC2PEN               ((unsigned int)0x00000200)
#define  RCC_APB2LPENR_ADC3LPEN              ((unsigned int)0x00000400)
#define  RCC_APB2LPENR_SDIOLPEN              ((unsigned int)0x00000800)
#define  RCC_APB2LPENR_SPI1LPEN              ((unsigned int)0x00001000)
#define  RCC_APB2LPENR_SPI4LPEN              ((unsigned int)0x00002000)
#define  RCC_APB2LPENR_SYSCFGLPEN            ((unsigned int)0x00004000)
#define  RCC_APB2LPENR_TIM9LPEN              ((unsigned int)0x00010000)
#define  RCC_APB2LPENR_TIM10LPEN             ((unsigned int)0x00020000)
#define  RCC_APB2LPENR_TIM11LPEN             ((unsigned int)0x00040000)
#define  RCC_APB2LPENR_SPI5LPEN              ((unsigned int)0x00100000)
#define  RCC_APB2LPENR_SPI6LPEN              ((unsigned int)0x00200000)
#define  RCC_APB2LPENR_SAI1LPEN              ((unsigned int)0x00400000)
#define  RCC_APB2LPENR_LTDCLPEN              ((unsigned int)0x04000000)

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      ((unsigned int)0x00000001)
#define  RCC_BDCR_LSERDY                     ((unsigned int)0x00000002)
#define  RCC_BDCR_LSEBYP                     ((unsigned int)0x00000004)
#define  RCC_BDCR_LSEMOD                     ((unsigned int)0x00000008)

#define  RCC_BDCR_RTCSEL                    ((unsigned int)0x00000300)
#define  RCC_BDCR_RTCSEL_0                  ((unsigned int)0x00000100)
#define  RCC_BDCR_RTCSEL_1                  ((unsigned int)0x00000200)

