raphui/rnk/include/platform/stm32f746.h
#define  RCC_BDCR_RTCEN                      ((unsigned int)0x00008000)
#define  RCC_BDCR_BDRST                      ((unsigned int)0x00010000)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ((unsigned int)0x00000001)
#define  RCC_CSR_LSIRDY                      ((unsigned int)0x00000002)
#define  RCC_CSR_RMVF                        ((unsigned int)0x01000000)
#define  RCC_CSR_BORRSTF                     ((unsigned int)0x02000000)
#define  RCC_CSR_PADRSTF                     ((unsigned int)0x04000000)
#define  RCC_CSR_PORRSTF                     ((unsigned int)0x08000000)
#define  RCC_CSR_SFTRSTF                     ((unsigned int)0x10000000)
#define  RCC_CSR_WDGRSTF                     ((unsigned int)0x20000000)
#define  RCC_CSR_WWDGRSTF                    ((unsigned int)0x40000000)
#define  RCC_CSR_LPWRRSTF                    ((unsigned int)0x80000000)

/********************  Bit definition for RCC_SSCGR register  *****************/
#define  RCC_SSCGR_MODPER                    ((unsigned int)0x00001FFF)
#define  RCC_SSCGR_INCSTEP                   ((unsigned int)0x0FFFE000)
#define  RCC_SSCGR_SPREADSEL                 ((unsigned int)0x40000000)
#define  RCC_SSCGR_SSCGEN                    ((unsigned int)0x80000000)

/********************  Bit definition for RCC_PLLI2SCFGR register  ************/
#define  RCC_PLLI2SCFGR_PLLI2SM              ((unsigned int)0x0000003F)
#define  RCC_PLLI2SCFGR_PLLI2SM_0            ((unsigned int)0x00000001)
#define  RCC_PLLI2SCFGR_PLLI2SM_1            ((unsigned int)0x00000002)
#define  RCC_PLLI2SCFGR_PLLI2SM_2            ((unsigned int)0x00000004)
#define  RCC_PLLI2SCFGR_PLLI2SM_3            ((unsigned int)0x00000008)
#define  RCC_PLLI2SCFGR_PLLI2SM_4            ((unsigned int)0x00000010)
#define  RCC_PLLI2SCFGR_PLLI2SM_5            ((unsigned int)0x00000020)

#define  RCC_PLLI2SCFGR_PLLI2SN              ((unsigned int)0x00007FC0)
#define  RCC_PLLI2SCFGR_PLLI2SN_0            ((unsigned int)0x00000040)
#define  RCC_PLLI2SCFGR_PLLI2SN_1            ((unsigned int)0x00000080)
#define  RCC_PLLI2SCFGR_PLLI2SN_2            ((unsigned int)0x00000100)
#define  RCC_PLLI2SCFGR_PLLI2SN_3            ((unsigned int)0x00000200)
#define  RCC_PLLI2SCFGR_PLLI2SN_4            ((unsigned int)0x00000400)
#define  RCC_PLLI2SCFGR_PLLI2SN_5            ((unsigned int)0x00000800)
#define  RCC_PLLI2SCFGR_PLLI2SN_6            ((unsigned int)0x00001000)
#define  RCC_PLLI2SCFGR_PLLI2SN_7            ((unsigned int)0x00002000)
#define  RCC_PLLI2SCFGR_PLLI2SN_8            ((unsigned int)0x00004000)

#define  RCC_PLLI2SCFGR_PLLI2SQ              ((unsigned int)0x0F000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_0            ((unsigned int)0x01000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_1            ((unsigned int)0x02000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_2            ((unsigned int)0x04000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_3            ((unsigned int)0x08000000)

#define  RCC_PLLI2SCFGR_PLLI2SR              ((unsigned int)0x70000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_0            ((unsigned int)0x10000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_1            ((unsigned int)0x20000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_2            ((unsigned int)0x40000000)

/********************  Bit definition for RCC_PLLSAICFGR register  ************/
#define  RCC_PLLSAICFGR_PLLSAIN              ((unsigned int)0x00007FC0)
#define  RCC_PLLSAICFGR_PLLSAIN_0            ((unsigned int)0x00000040)
#define  RCC_PLLSAICFGR_PLLSAIN_1            ((unsigned int)0x00000080)
#define  RCC_PLLSAICFGR_PLLSAIN_2            ((unsigned int)0x00000100)
#define  RCC_PLLSAICFGR_PLLSAIN_3            ((unsigned int)0x00000200)
#define  RCC_PLLSAICFGR_PLLSAIN_4            ((unsigned int)0x00000400)
#define  RCC_PLLSAICFGR_PLLSAIN_5            ((unsigned int)0x00000800)
#define  RCC_PLLSAICFGR_PLLSAIN_6            ((unsigned int)0x00001000)
#define  RCC_PLLSAICFGR_PLLSAIN_7            ((unsigned int)0x00002000)
#define  RCC_PLLSAICFGR_PLLSAIN_8            ((unsigned int)0x00004000)

#define  RCC_PLLSAICFGR_PLLSAIQ              ((unsigned int)0x0F000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_0            ((unsigned int)0x01000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_1            ((unsigned int)0x02000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_2            ((unsigned int)0x04000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_3            ((unsigned int)0x08000000)

#define  RCC_PLLSAICFGR_PLLSAIR              ((unsigned int)0x70000000)
#define  RCC_PLLSAICFGR_PLLSAIR_0            ((unsigned int)0x10000000)
#define  RCC_PLLSAICFGR_PLLSAIR_1            ((unsigned int)0x20000000)
#define  RCC_PLLSAICFGR_PLLSAIR_2            ((unsigned int)0x40000000)

/********************  Bit definition for RCC_DCKCFGR register  ***************/
#define  RCC_DCKCFGR_PLLI2SDIVQ              ((unsigned int)0x0000001F)
#define  RCC_DCKCFGR_PLLSAIDIVQ              ((unsigned int)0x00001F00)
#define  RCC_DCKCFGR_PLLSAIDIVR              ((unsigned int)0x00030000)

#define  RCC_DCKCFGR_SAI1ASRC                ((unsigned int)0x00300000)
#define  RCC_DCKCFGR_SAI1ASRC_0              ((unsigned int)0x00100000)
#define  RCC_DCKCFGR_SAI1ASRC_1              ((unsigned int)0x00200000)

#define  RCC_DCKCFGR_SAI1BSRC                ((unsigned int)0x00C00000)
#define  RCC_DCKCFGR_SAI1BSRC_0              ((unsigned int)0x00400000)
#define  RCC_DCKCFGR_SAI1BSRC_1              ((unsigned int)0x00800000)

#define  RCC_DCKCFGR_TIMPRE                  ((unsigned int)0x01000000)
#define  RCC_DCKCFGR_CK48MSEL                ((unsigned int)0x08000000)

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ((unsigned int)0x00000004)
#define RNG_CR_IE                            ((unsigned int)0x00000008)

