raphui/rnk/include/platform/stm32f746.h
#define  SPI_CR1_BR                          ((unsigned short)0x0038)            /*!<BR[2:0] bits (Baud Rate Control) */
#define  SPI_CR1_BR_0                        ((unsigned short)0x0008)            /*!<Bit 0 */
#define  SPI_CR1_BR_1                        ((unsigned short)0x0010)            /*!<Bit 1 */
#define  SPI_CR1_BR_2                        ((unsigned short)0x0020)            /*!<Bit 2 */

#define  SPI_CR1_SPE                         ((unsigned short)0x0040)            /*!<SPI Enable                          */
#define  SPI_CR1_LSBFIRST                    ((unsigned short)0x0080)            /*!<Frame Format                        */
#define  SPI_CR1_SSI                         ((unsigned short)0x0100)            /*!<Internal slave select               */
#define  SPI_CR1_SSM                         ((unsigned short)0x0200)            /*!<Software slave management           */
#define  SPI_CR1_RXONLY                      ((unsigned short)0x0400)            /*!<Receive only                        */
#define  SPI_CR1_DFF                         ((unsigned short)0x0800)            /*!<Data Frame Format                   */
#define  SPI_CR1_CRCNEXT                     ((unsigned short)0x1000)            /*!<Transmit CRC next                   */
#define  SPI_CR1_CRCEN                       ((unsigned short)0x2000)            /*!<Hardware CRC calculation enable     */
#define  SPI_CR1_BIDIOE                      ((unsigned short)0x4000)            /*!<Output enable in bidirectional mode */
#define  SPI_CR1_BIDIMODE                    ((unsigned short)0x8000)            /*!<Bidirectional data mode enable      */

/*******************  Bit definition for SPI_CR2 register  ********************/
#define  SPI_CR2_RXDMAEN                     ((unsigned char)0x01)               /*!<Rx Buffer DMA Enable                 */
#define  SPI_CR2_TXDMAEN                     ((unsigned char)0x02)               /*!<Tx Buffer DMA Enable                 */
#define  SPI_CR2_SSOE                        ((unsigned char)0x04)               /*!<SS Output Enable                     */
#define  SPI_CR2_ERRIE                       ((unsigned char)0x20)               /*!<Error Interrupt Enable               */
#define  SPI_CR2_RXNEIE                      ((unsigned char)0x40)               /*!<RX buffer Not Empty Interrupt Enable */
#define  SPI_CR2_TXEIE                       ((unsigned char)0x80)               /*!<Tx buffer Empty Interrupt Enable     */

/********************  Bit definition for SPI_SR register  ********************/
#define  SPI_SR_RXNE                         ((unsigned char)0x01)               /*!<Receive buffer Not Empty */
#define  SPI_SR_TXE                          ((unsigned char)0x02)               /*!<Transmit buffer Empty    */
#define  SPI_SR_CHSIDE                       ((unsigned char)0x04)               /*!<Channel side             */
#define  SPI_SR_UDR                          ((unsigned char)0x08)               /*!<Underrun flag            */
#define  SPI_SR_CRCERR                       ((unsigned char)0x10)               /*!<CRC Error flag           */
#define  SPI_SR_MODF                         ((unsigned char)0x20)               /*!<Mode fault               */
#define  SPI_SR_OVR                          ((unsigned char)0x40)               /*!<Overrun flag             */
#define  SPI_SR_BSY                          ((unsigned char)0x80)               /*!<Busy flag                */

/********************  Bit definition for SPI_DR register  ********************/
#define  SPI_DR_DR                           ((unsigned short)0xFFFF)            /*!<Data Register           */

/*******************  Bit definition for SPI_CRCPR register  ******************/
#define  SPI_CRCPR_CRCPOLY                   ((unsigned short)0xFFFF)            /*!<CRC polynomial register */

/******************  Bit definition for SPI_RXCRCR register  ******************/
#define  SPI_RXCRCR_RXCRC                    ((unsigned short)0xFFFF)            /*!<Rx CRC Register         */

/******************  Bit definition for SPI_TXCRCR register  ******************/
#define  SPI_TXCRCR_TXCRC                    ((unsigned short)0xFFFF)            /*!<Tx CRC Register         */

/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define  SPI_I2SCFGR_CHLEN                   ((unsigned short)0x0001)            /*!<Channel length (number of bits per audio channel) */

#define  SPI_I2SCFGR_DATLEN                  ((unsigned short)0x0006)            /*!<DATLEN[1:0] bits (Data length to be transferred)  */
#define  SPI_I2SCFGR_DATLEN_0                ((unsigned short)0x0002)            /*!<Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                ((unsigned short)0x0004)            /*!<Bit 1 */

#define  SPI_I2SCFGR_CKPOL                   ((unsigned short)0x0008)            /*!<steady state clock polarity               */

#define  SPI_I2SCFGR_I2SSTD                  ((unsigned short)0x0030)            /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                ((unsigned short)0x0010)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                ((unsigned short)0x0020)            /*!<Bit 1 */

#define  SPI_I2SCFGR_PCMSYNC                 ((unsigned short)0x0080)            /*!<PCM frame synchronization                 */

#define  SPI_I2SCFGR_I2SCFG                  ((unsigned short)0x0300)            /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                ((unsigned short)0x0100)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                ((unsigned short)0x0200)            /*!<Bit 1 */

#define  SPI_I2SCFGR_I2SE                    ((unsigned short)0x0400)            /*!<I2S Enable         */
#define  SPI_I2SCFGR_I2SMOD                  ((unsigned short)0x0800)            /*!<I2S mode selection */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define  SPI_I2SPR_I2SDIV                    ((unsigned short)0x00FF)            /*!<I2S Linear prescaler         */
#define  SPI_I2SPR_ODD                       ((unsigned short)0x0100)            /*!<Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     ((unsigned short)0x0200)            /*!<Master Clock Output Enable   */

/******************************************************************************/
/*                                                                            */
/*                                 SYSCFG                                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SYSCFG_MEMRMP register  ***************/  
#define SYSCFG_MEMRMP_MEM_MODE          ((unsigned int)0x00000007) /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_MEMRMP_MEM_MODE_0        ((unsigned int)0x00000001) /*!<Bit 0 */
#define SYSCFG_MEMRMP_MEM_MODE_1        ((unsigned int)0x00000002) /*!<Bit 1 */
#define SYSCFG_MEMRMP_MEM_MODE_2        ((unsigned int)0x00000004) /*!<Bit 2 */

