raphui/rnk/include/platform/stm32f746.h
#define  TIM_CR1_CMS                         ((unsigned short)0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((unsigned short)0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((unsigned short)0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        ((unsigned short)0x0080)            /*!<Auto-reload preload enable     */

#define  TIM_CR1_CKD                         ((unsigned short)0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((unsigned short)0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       ((unsigned short)0x0200)            /*!<Bit 1 */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCPC                        ((unsigned short)0x0001)            /*!<Capture/Compare Preloaded Control        */
#define  TIM_CR2_CCUS                        ((unsigned short)0x0004)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        ((unsigned short)0x0008)            /*!<Capture/Compare DMA Selection            */

#define  TIM_CR2_MMS                         ((unsigned short)0x0070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((unsigned short)0x0010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       ((unsigned short)0x0020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       ((unsigned short)0x0040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        ((unsigned short)0x0080)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        ((unsigned short)0x0100)            /*!<Output Idle state 1 (OC1 output)  */
#define  TIM_CR2_OIS1N                       ((unsigned short)0x0200)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        ((unsigned short)0x0400)            /*!<Output Idle state 2 (OC2 output)  */
#define  TIM_CR2_OIS2N                       ((unsigned short)0x0800)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        ((unsigned short)0x1000)            /*!<Output Idle state 3 (OC3 output)  */
#define  TIM_CR2_OIS3N                       ((unsigned short)0x2000)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        ((unsigned short)0x4000)            /*!<Output Idle state 4 (OC4 output)  */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define  TIM_SMCR_SMS                        ((unsigned short)0x0007)            /*!<SMS[2:0] bits (Slave mode selection)    */
#define  TIM_SMCR_SMS_0                      ((unsigned short)0x0001)            /*!<Bit 0 */
#define  TIM_SMCR_SMS_1                      ((unsigned short)0x0002)            /*!<Bit 1 */
#define  TIM_SMCR_SMS_2                      ((unsigned short)0x0004)            /*!<Bit 2 */

#define  TIM_SMCR_TS                         ((unsigned short)0x0070)            /*!<TS[2:0] bits (Trigger selection)        */
#define  TIM_SMCR_TS_0                       ((unsigned short)0x0010)            /*!<Bit 0 */
#define  TIM_SMCR_TS_1                       ((unsigned short)0x0020)            /*!<Bit 1 */
#define  TIM_SMCR_TS_2                       ((unsigned short)0x0040)            /*!<Bit 2 */

#define  TIM_SMCR_MSM                        ((unsigned short)0x0080)            /*!<Master/slave mode                       */

#define  TIM_SMCR_ETF                        ((unsigned short)0x0F00)            /*!<ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      ((unsigned short)0x0100)            /*!<Bit 0 */
#define  TIM_SMCR_ETF_1                      ((unsigned short)0x0200)            /*!<Bit 1 */
#define  TIM_SMCR_ETF_2                      ((unsigned short)0x0400)            /*!<Bit 2 */
#define  TIM_SMCR_ETF_3                      ((unsigned short)0x0800)            /*!<Bit 3 */

#define  TIM_SMCR_ETPS                       ((unsigned short)0x3000)            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     ((unsigned short)0x1000)            /*!<Bit 0 */
#define  TIM_SMCR_ETPS_1                     ((unsigned short)0x2000)            /*!<Bit 1 */

#define  TIM_SMCR_ECE                        ((unsigned short)0x4000)            /*!<External clock enable     */
#define  TIM_SMCR_ETP                        ((unsigned short)0x8000)            /*!<External trigger polarity */

/*******************  Bit definition for TIM_DIER register  *******************/
#define  TIM_DIER_UIE                        ((unsigned short)0x0001)            /*!<Update interrupt enable */
#define  TIM_DIER_CC1IE                      ((unsigned short)0x0002)            /*!<Capture/Compare 1 interrupt enable   */
#define  TIM_DIER_CC2IE                      ((unsigned short)0x0004)            /*!<Capture/Compare 2 interrupt enable   */
#define  TIM_DIER_CC3IE                      ((unsigned short)0x0008)            /*!<Capture/Compare 3 interrupt enable   */
#define  TIM_DIER_CC4IE                      ((unsigned short)0x0010)            /*!<Capture/Compare 4 interrupt enable   */
#define  TIM_DIER_COMIE                      ((unsigned short)0x0020)            /*!<COM interrupt enable                 */
#define  TIM_DIER_TIE                        ((unsigned short)0x0040)            /*!<Trigger interrupt enable             */
#define  TIM_DIER_BIE                        ((unsigned short)0x0080)            /*!<Break interrupt enable               */
#define  TIM_DIER_UDE                        ((unsigned short)0x0100)            /*!<Update DMA request enable            */
#define  TIM_DIER_CC1DE                      ((unsigned short)0x0200)            /*!<Capture/Compare 1 DMA request enable */
#define  TIM_DIER_CC2DE                      ((unsigned short)0x0400)            /*!<Capture/Compare 2 DMA request enable */
#define  TIM_DIER_CC3DE                      ((unsigned short)0x0800)            /*!<Capture/Compare 3 DMA request enable */
#define  TIM_DIER_CC4DE                      ((unsigned short)0x1000)            /*!<Capture/Compare 4 DMA request enable */
#define  TIM_DIER_COMDE                      ((unsigned short)0x2000)            /*!<COM DMA request enable               */
#define  TIM_DIER_TDE                        ((unsigned short)0x4000)            /*!<Trigger DMA request enable           */

/********************  Bit definition for TIM_SR register  ********************/
#define  TIM_SR_UIF                          ((unsigned short)0x0001)            /*!<Update interrupt Flag              */
#define  TIM_SR_CC1IF                        ((unsigned short)0x0002)            /*!<Capture/Compare 1 interrupt Flag   */
#define  TIM_SR_CC2IF                        ((unsigned short)0x0004)            /*!<Capture/Compare 2 interrupt Flag   */
#define  TIM_SR_CC3IF                        ((unsigned short)0x0008)            /*!<Capture/Compare 3 interrupt Flag   */
#define  TIM_SR_CC4IF                        ((unsigned short)0x0010)            /*!<Capture/Compare 4 interrupt Flag   */
#define  TIM_SR_COMIF                        ((unsigned short)0x0020)            /*!<COM interrupt Flag                 */
#define  TIM_SR_TIF                          ((unsigned short)0x0040)            /*!<Trigger interrupt Flag             */
#define  TIM_SR_BIF                          ((unsigned short)0x0080)            /*!<Break interrupt Flag               */
#define  TIM_SR_CC1OF                        ((unsigned short)0x0200)            /*!<Capture/Compare 1 Overcapture Flag */
#define  TIM_SR_CC2OF                        ((unsigned short)0x0400)            /*!<Capture/Compare 2 Overcapture Flag */
#define  TIM_SR_CC3OF                        ((unsigned short)0x0800)            /*!<Capture/Compare 3 Overcapture Flag */
#define  TIM_SR_CC4OF                        ((unsigned short)0x1000)            /*!<Capture/Compare 4 Overcapture Flag */

/*******************  Bit definition for TIM_EGR register  ********************/
#define  TIM_EGR_UG                          ((unsigned char)0x01)               /*!<Update Generation                         */
#define  TIM_EGR_CC1G                        ((unsigned char)0x02)               /*!<Capture/Compare 1 Generation              */
#define  TIM_EGR_CC2G                        ((unsigned char)0x04)               /*!<Capture/Compare 2 Generation              */
#define  TIM_EGR_CC3G                        ((unsigned char)0x08)               /*!<Capture/Compare 3 Generation              */
#define  TIM_EGR_CC4G                        ((unsigned char)0x10)               /*!<Capture/Compare 4 Generation              */
#define  TIM_EGR_COMG                        ((unsigned char)0x20)               /*!<Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          ((unsigned char)0x40)               /*!<Trigger Generation                        */
#define  TIM_EGR_BG                          ((unsigned char)0x80)               /*!<Break Generation                          */

